import 'question.dart';

final List<Question> fifthChapterQuestions = [
  Question(
    id: 5001,
    text: '1905-1906 жылдары Қазақстанда жұмысшылар толқуының болуына әсер еткен оқиға:',
    options: [
      'Ақпан төңкерісі',
      'Қазан төңкерісі',
      'Бірінші орыс революциясы',
      'Азамат соғысы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5002,
    text: '1906 жылғы қабылданған реформаның сипаты:',
    options: ['Әскери', 'Саяси', 'Әлеуметтік', 'Аграрлық'],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5003,
    text: '1910 жылғы Столыпин реформасының мақсаты:',
    options: [
      'Шаруаларға жер беру',
      'Өнеркәсіпті дамыту',
      'Революцияны тұншықтыру',
      'Білім беруді жақсарту'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5004,
    text:
        '1913 жылдың өзінде «Қазақ ұлтының өмір сүруінің өзі проблемаға айналды» деп жазған:',
    options: ['М.Дулатұлы', 'А.Байтұрсынов', 'Ә.Бөкейханов', 'Ж.Аймауытов'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5005,
    text:
        'ХХ ғасыр басындағы Қазақстандағы жұмысшылардың бас көтерулері мен ереуілдері кең қанат жайды:',
    options: [
      'Мұнайшылардың арасында',
      'Кеншілердің арасында',
      'Теміржолшылардың арасында',
      'Тоқымашылардың арасында'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5006,
    text:
        'Қазақ халқының өз құқықтарын қорғау жолындағы күресінің өзіндік ерекшелігінің бірі:',
    options: [
      'Қарулы көтерілістер',
      'Петициялар жолдау',
      'Жаппай ереуілдер',
      'Шетелдіктермен келіссөздер'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5007,
    text: 'Алғашқы петициялар жолдаған дін өкілдері мен жергілікті кәсіпкерлер:',
    options: [
      'М.Шоқай, С.Меңдешов',
      'А.Иманов, Ә.Жангелдин',
      'Науан хазірет, Бейіс хазірет, көпес Шәймерден Қосшығұлұлы',
      'Т.Бокин, Б.Әшекеев'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5008,
    text: 'Бірінші орыс революциясы жылдарында петициялар жазуды ұйымдастырды:',
    options: [
      'Патша үкіметінің өкілдері',
      'Шетелдік дипломаттар',
      'Қазақ қоғамының сауатты, зиялы өкілдері',
      'Діни ұйымдардың басшылары'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5009,
    text: 'ХХ ғасыр басында Алаш зиялылары ұстанған бейбіт күрес әдісі:',
    options: [
      'Террорлық әрекеттер',
      'Партизандық соғыс',
      'Петициялар',
      'Жаппай аштық жариялау'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5010,
    text: 'Алаш идеясының өзекті тұстары алғаш көрініс тапқан петиция:',
    options: ['Семей', 'Орынбор', 'Қарқаралы', 'Ақмола'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5011,
    text:
        '1905 жылы Қарқаралы қаласы Қоянды жәрмеңкесіндегі петицияны дайындауға белсене қатысқандар:',
    options: [
      'Ә.Бөкейхан, А.Байтұрсынұлы, Ж.Ақбаев, М.Дулатұлы, Т.Нұрекенов',
      'М.Шоқай, С.Сейфуллин, Т.Рысқұлов',
      'А.Иманов, Ә.Жангелдин, Б.Қаратаев',
      'С.Меңдешов, Т.Бокин, Б.Әшекеев'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5012,
    text:
        '1905 жылы тамызда ІІ Николай Ресейдегі революциялық күштердің қысымымен империяның заң шығарушы және өкілетті органы ретінде қол қойды:',
    options: [
      'Жер туралы декретке',
      'Бейбітшілік туралы декретке',
      'Мемлекеттік Дума құру туралы манифестке',
      'Ұлттардың өзін-өзі билеу құқығы туралы декларацияға'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5013,
    text:
        'ХХ ғасыр басында ұлт зиялыларының қазақ халқы үшін атқарған іс-шараларының бірі:',
    options: [
      'КСРО құрамына кіруді қолдады',
      'Мемлекеттік Дума ісіне араласты',
      'Шетелдік интервенцияны жақтады',
      'Қарулы көтеріліс ұйымдастырды'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5014,
    text: 'ХХ ғ. басында петициялық қозғалыстың нәтижесі:',
    options: [
      'Қазақтарға жер берілді',
      'Қазақтар автономия алды',
      'Қазақтар мемлекеттік Думаға сайланды',
      'Қазақтардың саяси құқықтары шектелді'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5015,
    text:
        '1906 жылы І Мемлекеттік Думаның құрамына қазақ облыстарынан сайланған депутаттар:',
    options: [
      'Торғай облысынан – А.Бірімжанов, Семей облысынан – Ә.Бөкейханов, Бөкей ордасынан – А.Қалменов, Уфа губерниясынан – С.Жантөрин',
      'Ақмола облысынан – Ш.Қосшығұлұлы, Жетісу облысынан – М.Тынышбаев',
      'Орал облысынан – Б.Қаратаев, Сырдария облысынан – М.Шоқай',
      'Ферғана облысынан – Т.Рысқұлов, Самарқан облысынан – С.Сейфуллин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5016,
    text:
        '1907 жылы ІІ Мемлекеттік Думаға сайланған қазақ облыстарынан сайланған депутаттар:',
    options: [
      'Ақмола облысынан – Ш.Қосшығұлұлы, Торғай облысынан – А.Бірімжанов, Семей облысынан – Т.Нұрекенов, Жетісу облысынан – М.Тынышбаев, Орал облысынан – Б.Қаратаев',
      'Сырдария облысынан – М.Шоқай, Ферғана облысынан – Т.Рысқұлов',
      'Самарқан облысынан – С.Сейфуллин, Бөкей ордасынан – А.Қалменов',
      'Уфа губерниясынан – С.Жантөрин, Торғай облысынан – Ә.Бөкейханов'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5017,
    text: 'ІІ Мемлекеттік Думаға сайланған қазақ депутаттары талап етті:',
    options: [
      'Қазақстанға қоныс аударту үдересін тоқтату',
      'Қазақтарға автономия беру',
      'Қазақ тілін мемлекеттік тіл ету',
      'Қазақтарды әскерге алу'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5018,
    text:
        'ІІ Мемлекеттік Думада Ресейден шаруаларды қоныс аударту саясатының қазақтар үшін ауыр болды деп баяндама жасаған:',
    options: [
      'Ә.Бөкейханов',
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Б.Қаратаев'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5019,
    text:
        'Қара жұмысқа алу туралы патша жарлығын орындауға шақырған зиялылар өкілі:',
    options: [
      'Ә.Бөкейханов, А.Байтұрсынов, М.Дулатов',
      'С.Сейфуллин, Т.Рысқұлов, С.Меңдешов',
      'А.Иманов, Ә.Жангелдин',
      'Т.Бокин, Б.Әшекеев'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5020,
    text:
        '1916 жылғы ұлт-азаттық қозғалысқа қатысқан революцияшыл-демократияшыл зиялылар:',
    options: [
      'Ә.Бөкейханов, А.Байтұрсынов, М.Дулатов',
      'Ә.Майкөтов, Т.Рысқұлов, Т.Бокин, С.Меңдешов, С.Сейфуллин, Ә.Жангелдин',
      'А.Иманов, Б.Қаратаев',
      'М.Шоқай, С.Жантөрин'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5021,
    text: '1916 жылғы ұлт-азаттық көтерілістің ірі орталықтары:',
    options: [
      'Семей, Орал',
      'Торғай, Жетісу',
      'Ақмола, Қостанай',
      'Батыс Қазақстан, Шығыс Қазақстан'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5022,
    text:
        '1916 жылғы ұлт-азаттық көтерілістің ең ұйымдасқан, табанды қарсылық көрсеткен, халық көп қатысқан орталығы:',
    options: [
      'Жетісу облысы',
      'Торғай облысы',
      'Сырдария облысы',
      'Орал облысы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5023,
    text: '1916 жылы Торғайда болған көтеріліс ерекшеленді:',
    options: [
      'Әскери дайындығымен',
      'Қаржылық көмекпен',
      'Бір орталыққа бағындырылған басқарудың тәртіпке келтірілген жүйесімен',
      'Қару-жарақпен'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5024,
    text:
        '1916 жылғы ұлт-азаттық қозғалыс кезінде Торғай уезіндегі қыпшақ руының көтеріліске шыққан қазақтары хан етіп сайлады:',
    options: ['А. Иманов', 'Ә. Жанбосынов', 'Т. Бокин', 'Б. Әшекеев'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5025,
    text: 'Торғайдағы көтерілісшілердің сардарбегі:',
    options: ['Кейкі батыр', 'А. Иманов', 'Ә. Жангелдин', 'Ұ. Саурықов'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5026,
    text: 'Торғайдағы көтеріліс сардарбегі Амангелді Имановтың серігі, мерген:',
    options: ['А.Иманов', 'Ә.Жанбосынов', 'Кейкі батыр', 'Т.Бокин'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5027,
    text: 'Жетісудағы 1916 жылғы көтерілістің ерекшелігі:',
    options: [
      'Тек қазақтар қатысты',
      'Тек орыстар қатысты',
      'Әртүрлі ұлттардың қатысуы',
      'Тек дін өкілдері қатысты'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5028,
    text: '1916 жылғы Жетісудағы ұлт-азаттық көтерілістің жетекшілері:',
    options: [
      'Ғ.Мүсірепов, Ғ.Мұстафин',
      'М.Әуезов, С.Мұқанов',
      'Б.Әшекеев, Т.Бокин, Ұ.Саурықов, Ж.Мәмбетов',
      'С.Сейфуллин, Б.Майлин'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5029,
    text: '1917 жылғы 27-ақпанда Ресейде болған революцияның сипаты:',
    options: [
      'Социалистік-революциялық',
      'Монархиялық',
      'Буржуазиялық-демократиялық',
      'Анархиялық'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5030,
    text: 'Ақпан буржуазиялық-демократиялық революциясының барысында орнаған қос өкіметке енді:',
    options: [
      'Уақытша үкімет және Кеңестер',
      'Әскери үкімет және шіркеу',
      'Монархия және шіркеу',
      'Ақсүйектер жиналысы'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5031,
    text: 'Уақытша үкіметтің Қазақстандағы комиссарлары:',
    options: [
      'С.Сейфуллин, С.Меңдешов',
      'Ә.Бөкейханов, М.Тынышбаев, М.Шоқай',
      'А.Байтұрсынұлы, М.Дулатұлы',
      'Т.Рысқұлов, Ә.Жангелдин'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5032,
    text: 'Ақпан революциясынан кейін Ақмолада жұмыс істеген жастар қозғалысы:',
    options: ['"Қазақ"', '"Жас қазақ"', '"Айқап"', '"Серке"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5033,
    text:
        'ХХ ғ. басында қазақ халқын біріктіру мен болашақта мемлекеттілік дәстүрін қалпына келтіруді көздеген ұлт-азаттық қозғалыс:',
    options: ['"Қазақ"', '"Алаш"', '"Үш жүз"', '"Жас арбакештер"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5034,
    text: 'Қазақ зиялыларының қоғамдағы қызметтерімен тікелей байланысты қозғалыс:',
    options: ['"Қазақ"', '"Алаш"', '"Үш Жүз"', '"Жас Түркістан"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5035,
    text: 'ХХ ғ. басында Алаш қозғалысының көздеген мақсаты:',
    options: [
      'Қазақ халқын біріктіру мен болашақта мемлекеттілік дәстүрін қалпына келтіру',
      'Ресей империясының құрамында қалу',
      'Социалистік қоғам құру',
      'Шетелдік интервенцияны қолдау'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5036,
    text: '«Алаш» қозғалысының жетекшісі:',
    options: [
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Ә.Бөкейханов',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5037,
    text: 'Алашорда автономиясының орталығы болып жарияланған қала:',
    options: ['Орынбор', 'Семей', 'Ақмола', 'Қызылорда'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5038,
    text: '«Алаш» партиясы бағдарламасының жобасы жарияланды:',
    options: [
      '"Серке" газетінде',
      '"Қазақ" газетінде',
      '"Айқап" журналында',
      '"Искра" газетінде'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5039,
    text: 'Алаш қозғалысының ұстанымдары көрініс тапты:',
    options: [
      '"Алаш" партиясы бағдарламасында',
      '"Үш жүз" партиясының бағдарламасында',
      '"Қазақ" газетінде',
      '"Айқап" журналында'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5040,
    text:
        'Алашорда автономиясы басшыларының ақгвардияшылардан алшақтауының себебі:',
    options: [
      'Ақ гвардияшылардың Алаш автономиясын мойындамауы',
      'Қызыл армияның жеңісі',
      'Шетелдік интервенцияның басталуы',
      'Ә.Бөкейхановтың өлімі'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5041,
    text:
        'Азамат соғысы жылдарында Қазақстан аумағында құрылған Алашорда үкіметінің бөлімшелері:',
    options: [
      'Семейде Ә.Бөкейхан басқарған Шығыс бөлімшесі, Батыс Қазақстанда Ж.Досмұхамедұлы және Х.Досмұхамедұлы басқарған Батыс бөлімшесі, Торғайда А.Байтұрсынұлы басқарған Торғай бөлімшесі',
      'Орынборда М.Дулатұлы басқарған Орталық бөлімшесі',
      'Ақмолада С.Сейфуллин басқарған Солтүстік бөлімшесі',
      'Қызылордада Т.Рысқұлов басқарған Оңтүстік бөлімшесі'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5042,
    text: 'Ә.Бөкейхановтың Кадет партиясынан шығу себебі:',
    options: [
      'Діни көзқарастары',
      'Ұлттық автономия құруды көздеді',
      'Экономикалық бағдарламалары',
      'Әлеуметтік мәселелер'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5043,
    text: 'Ә.Бөкейханов басқарған «Алаш» партиясына қарсы болған социал-демократиялық партия:',
    options: ['"Алаш"', '"Үш жүз"', '"Қазақ"', '"Айқап"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5044,
    text: '1917 жылы құрылған Түркістан автономиясының алғашқы басшылары:',
    options: [
      'М.Тынышпаев, М.Шоқай',
      'Ә.Бөкейханов, А.Байтұрсынов',
      'С.Сейфуллин, Т.Рысқұлов',
      'А.Иманов, Ә.Жангелдин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5045,
    text: '«Түркістан автономиясында» алғашында министр-төраға және ішкі істер министрі болған:',
    options: [
      'М.Шоқай',
      'Ә.Бөкейханов',
      'М.Тынышбаев',
      'А.Байтұрсынов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5046,
    text: 'Ислам дінін мемлекеттік дін ретінде жариялаған автономия:',
    options: ['Түркістан', 'Алаш', 'Қазақ', 'Қоқан'],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5047,
    text:
        '1866 жылы Семей облысы Қарқаралы уезі Тоқырауын болысының Қызыларай мекенінде дүниеге келген:',
    options: [
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Ж.Аймауытов',
      'А.Байтұрсынов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5048,
    text:
        '1890 жылы Санкт-Петербургтегі Орман институтына түсіп және өз бетінше емтихан тапсырып, заң факультетін бітіріп шыққан тұлға:',
    options: [
      'Ш.Уәлиханов',
      'Ә.Бөкейхан',
      'Ы.Алтынсарин',
      'А.Құнанбаев'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5049,
    text:
        'Ұлт тәуелсіздігіне тек белсенді саяси күрес арқылы ғана жетуге болатынын айтқан:',
    options: [
      'Ә.Бөкейхан',
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'С.Сейфуллин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5050,
    text:
        'Өз отаны мен халқына адал қызмет етуге шақырған Алаш қозғалысының жетекшісі:',
    options: [
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Ж.Аймауытов',
      'А.Байтұрсынов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5051,
    text: '2016 жылы 150 жылдығы ЮНЕСКО көлемінде атап өтілген тұлға:',
    options: [
      'Ә.Бөкейхан',
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5052,
    text:
        '1911 жылы Санкт-Петербургте «Қазақ елінің жарғысы» деп аталатын жобасын әзірлеген Алаш қозғалысы көрнекті қайраткерлерінің бірі:',
    options: ['"Серке"', '"Қазақ"', '"Айқап"', '"Искра"'],
    correctOptionIndex: 0),
  Question(
    id: 5053,
    text:
        '1905 жылы патша манифесімен сөз және баспасөз бостандығы берілгеннен кейін Санкт-Петербургте шығарылған газет:',
    options: [
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5054,
    text:
        'Белгілі ақын, аса көрнекті ғалым, түрколог, публицист, педагог, аудармашы әрі қоғам қайраткері:',
    options: ['A) Барлыбек Сыртанұлы'],
    correctOptionIndex: 0),
  Question(
    id: 5055,
    text: 'Қазақ тілі ғылымының негізін салушы, қоғам қайраткері:',
    options: [
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5056,
    text:
        'Ахмет Байтұрсыновтың қазақ халқын ілім-білімге, әрі мәдениетті қоғам құруға шақырған өлеңдер жинағы:',
    options: ['"Оян, қазақ!"', '"Маса"', '"Қырық мысал"', '"Қазақ тілі"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5057,
    text: '1907 жылы ІІ Мемлекеттік Думаға Жетісу облысынан сайланған депутат:',
    options: [
      'С.Сейфуллин',
      'М.Тынышбаев',
      'Т.Рысқұлов',
      'Ә.Жангелдин'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5058,
    text: 'Медицина саласының білікті маманы, көрнекті тарихшы ғалым:',
    options: [
      'Б.Майлин',
      'С.Асфендияров',
      'М.Әуезов',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5059,
    text: 'Қазақтың алғашқы дәрігер ғалымдары:',
    options: [
      'Х.Досмұхамедов, Б.Бисенов',
      'М.Тынышбаев, С.Сейфуллин',
      'Т.Рысқұлов, Ә.Жангелдин',
      'А.Байтұрсынов, М.Дулатұлы'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5060,
    text: 'Бірінші қазақ Конституциясының жобасын дайындаған Алаш қайраткері:',
    options: [
      'Ә.Бөкейханов',
      'А.Байтұрсынов',
      'Б.Сыртанов',
      'М.Дулатұлы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5061,
    text:
        'Ә.Бөкейхановтың автономиялық бағдарламасынан Б.Сыртановтың Жарғысының айырмашылығын анықтаңыз:',
    options: [
      'Федеративті Қазақ Республикасын құру',
      'Тәуелсіз Қазақ Республикасын құру',
      'Қазақ АКСР-ін құру',
      'Ресей империясының құрамында қалу'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5062,
    text: '1917 жылғы Қазан төңкерісінің нәтижесі:',
    options: [
      'Ақ патша тақтан құлады',
      'Кеңестер билікке келді',
      'Уақытша үкімет құрылды',
      'Азамат соғысы басталды'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5063,
    text: 'Кеңестердің ІІ Бүкілресейлік съезі қабылдаған декреттер:',
    options: [
      'Бітім туралы, Жер туралы',
      'Ұлттар туралы, Білім туралы',
      'Әйелдер құқығы туралы, Балалар құқығы туралы',
      'Сауда туралы, Өнеркәсіп туралы'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5064,
    text: '1918-1920 жылдардың аралығында болған оқиға:',
    options: [
      'Бірінші дүниежүзілік соғыс',
      'Азамат соғысы мен шетелдік интервенция',
      'Ұлы Отан соғысы',
      'Қырғи қабақ соғыс'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5065,
    text:
        'Бір мемлекеттің ішіндегі бір-бірімен жауласушы жақтардың өкімет билігі үшін күресі:',
    options: [
      'Сыртқы күштердің әскери қақтығысқа араласуы',
      'Бір мемлекеттің ішіндегі әртүрлі топтардың билік үшін күресі',
      'Әртүрлі мемлекеттер арасындағы соғыс',
      'Жұмысшылар мен шаруалардың көтерілісі'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5066,
    text: 'Жаңа экономикалық саясаттың мәні:',
    options: [
      'Салықтарды көбейту',
      'Әскери коммунизм',
      'Жаппай ұжымдастыру',
      'Еңбек міндеткерлігін жою'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5067,
    text:
        'Жалпыға бірдей еңбек міндеткерлігі жойылып, кәсіпорындар шаруашылық есеп жүйесіне көшірілген саясат:',
    options: [
      'Әскери коммунизм',
      'Жаңа экономикалық саясат',
      'Индустрияландыру',
      'Ұжымдастыру'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5068,
    text: 'Кедейлерге көмектесу үшін 1921 жылы құрылған одақ:',
    options: [
      '"Қосшы одағы"',
      '"Алаш" партиясы',
      '"Үш жүз" партиясы',
      '"Жас арбакештер" одағы'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5069,
    text:
        '«Қосшы», «Жарлы» сияқты бұқаралық ұйымдар құрылған кезеңмен сәйкес келетін саясат:',
    options: [
      'Ұжымдастыру',
      'Индустрияландыру',
      'Жаңа экономикалық саясат',
      'Мәдени революция'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5070,
    text: 'Қазақ АКСР Халық Комиссарлары Кеңесінің төрағасы:',
    options: [
      'С.Меңдешов',
      'С.Сейфуллин',
      'Т.Рысқұлов',
      'В.Радус-Зенькович'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5071,
    text:
        'Оқиғалардың хронологиялық ретін анықтаңыз: 1) Қазақ КСР-ң құрылуы, 2) Қазақ АКСР-ң құрылуы, 3) Қазревкомның құрылуы:',
    options: ['3, 2, 1', '1, 2, 3', '2, 3, 1', '3, 1, 2'],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5072,
    text:
        'Қазақ мемлекеттілігінің кезеңдерін реті бойынша орналастырыңыз: 1) Қазақ КСР-ң құрылуы, 2) Қазақ АКСР-ң құрылуы, 3) Қазревкомның құрылуы:',
    options: ['2, 1, 3', '3, 1, 2', '1, 3, 2', '3, 2, 1'],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5073,
    text:
        'Этностың өз тарихи отанында тұрып жатқан, алайда ол аумақ көптеген әр түрлі жағдайларға байланысты өзге ел құрамында қалған өкілдері:',
    options: ['Диаспора', 'Репатриант', 'Ирредент', 'Мигрант'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5074,
    text:
        'Картада белгіленген сандар бойынша Қазақ елінің астаналарының ретін анықтаңыз:\n1.Ақмола; 2.Алматы; 3.Орынбор; 4.Қызылорда',
    options: ['3,4,2,1', '1,2,3,4', '4,3,2,1', '2,1,4,3'],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5075,
    text:
        'Дұрыс емес дәйекті анықтаңыз\n1920 жылы 26 тамызда Қазақ АКСР-ін құру туралы декрет шықты\n1920-1924 жылдары Қазақ АКСР-інің астанасы Қызылорда қаласы болды\n1926 жылғы халық санағы бойынша қазақтар Қазақстан халқының 61,3%-ын құрады\n1920 жылы Қазақ АКСР Орталық Атқару Комитетінің төрағасы болып В.Радус-Зенькович сайланды\nБелгілі бір аумақтың көлемін белгілеу «межелеу» деп аталады',
    options: ['1', '2', '3', '4', '5'],
    correctOptionIndex: 1),
  Question(
    id: 5076,
    text: 'Индустрияландыру жылдарында Қаныш Сәтпаевтың сіңірген еңбегі:',
    options: [
      'Түрксіб темір жолын жобалауға қатысты',
      'Жезқазған ауданындағы мыс кенін зерттеді',
      'Қарағанды көмір алабын зерттеді',
      'Ембі мұнайын зерттеді'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5077,
    text:
        '(жалғасы) Индустрияландыру жылдары зерттеу жүргізген ғалымдар мен зерттеген аймақтарын сәйкестендіріңіз:\nН.С.Курнаков, 2) Қ.Сәтбаев, 3) И.М.Губкин; А) Жезқазған ауданындағы мыс кенін, Ә) Орал-Ембі мұнайлы ауданын, Б) Орталық Қазақстанның минералдық шикізат байлықтарын',
    options: ['1-Б, 2-А, 3-Ә', '1-Б, 2-Ә, 3-А'],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5078,
    text: '1927-1931 жылдары салынған құрылыс:',
    options: [
      'Шымкент қорғасын зауыты',
      'Балқаш мыс қорыту зауыты',
      'Түркісіб теміржолы',
      'Қарағанды шахталары'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5079,
    text: 'Бірінші бесжылдық жылдары Қазақстанда ашылған кәсіпорындар:',
    options: [
      'Риддер полиметалл комбинаты, Қарсақбай полиметалл комбинаты, Қарағанды көмір кені, Балқаш мыс балқыту, Шымкент қорғасын зауыты',
      'Өскемен қорғасын-мырыш комбинаты, Лениногорск полиметалл комбинаты',
      'Екібастұз көмір алабы, Маңғыстау мұнай кен орны',
      'Ақтөбе ферроқорытпа зауыты, Жезқазған мыс комбинаты'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5080,
    text: '1940 жылдары Қазақстан өнеркәсібі дамыған елге айналды:',
    options: [
      'Ұжымдастыру нәтижесінде',
      'Индустрияландыру нәтижесінде',
      'Әскери коммунизм нәтижесінде',
      'Жаңа экономикалық саясат нәтижесінде'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5081,
    text: '1925-1933 жылдары Қазақ өлкелік партия комитетінің басшысы:',
    options: [
      'С.Меңдешов',
      'С.Сейфуллин',
      'Т.Рысқұлов',
      'Ф.Голощекин'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5087,
    text:
        '«Кіші Қазан» төңкерісін өткізуді ұсынған Голощекинның идеясын дұрыс деп бағалады:',
    options: ['В.Ленин', 'И.Сталин', 'Л.Троцкий', 'Н.Хрущев'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5084,
    text: 'Ф.Голощекиннің ұраны:',
    options: [
      '"Қазақстан - Ресейдің отары"',
      '"Ауылды кеңестендіру"',
      '"Қазақстанда кәсіподақтар құру"',
      '"Қазақ тілін мемлекеттік тіл ету"'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 86,
    text: 'Қазақ ауылының дәстүрлі әлеуметтік-шаруашылық құрылысын жойған саясаткер:',
    options: [
      'Ф.Голощекин',
      'С.Сейфуллин',
      'Т.Рысқұлов',
      'Ә.Жангелдин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 87,
    text:
        '«Кіші Қазан» төңкерісін өткізуді ұсынған Голощекинның идеясын дұрыс деп бағалады:',
    options: ['В.Ленин', 'И.Сталин', 'Л.Троцкий', 'Н.Хрущев'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5088,
    text: '1927 жылы БК(б)П-ның ХV съезінде қабылданған шешім:',
    options: [
      'Индустрияландыру',
      'Ұжымдастыру',
      'Жаңа экономикалық саясат',
      'Мәдени революция'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5089,
    text:
        '1929 жылы Қазақстанда 40 миллионнан астам мал болса, 1933 жылы 4,5 млн-ға азаюына себеп болған саясат:',
    options: [
      'Индустрияландыру',
      'Ұжымдастыру',
      'Жаңа экономикалық саясат',
      'Соғыс'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5090,
    text:
        'Ұлы Отан соғысына дейінгі жылдарындағы Қазақстанда маңызды мәдени өзгерістердің бірі:',
    options: [
      'Халықты жаппай сауаттандыру',
      'Жоғары оқу орындарын ашу',
      'Ғылыми зерттеулер жүргізу',
      'Өнеркәсіпті дамыту'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5091,
    text:
        '1918 жылы «Бірыңғай еңбек мектептері туралы» ережесіне сәйкес ашылған оқу орны:',
    options: [
      '3 сатылы бірыңғай еңбек мектептері',
      '2 сатылы бірыңғай еңбек мектептері',
      'Жоғары оқу орындары',
      'Арнаулы орта оқу орындары'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5092,
    text: '1919 жылы Халық Комиссарлары Кеңесі (ХКК) қол қойған декрет:',
    options: [
      'Жер туралы',
      'Бейбітшілік туралы',
      'Сауатсыздықты жою туралы',
      'Ұлттар туралы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5093,
    text: 'ХХ ғасыр басында сауатсыздықты жою күресінде жұмыс істеген білім ошақтары:',
    options: [
      '"Жас қазақ"',
      '"Қызыл отау"',
      '"Қосшы одағы"',
      '"Алаш" партиясы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5094,
    text:
        'Халық бұқарасының мәдени деңгейін көтеру мақсатында 1924 жылы ұйымдастырылған қоғам:',
    options: [
      '"Алаш" партиясы',
      '"Үш жүз" партиясы',
      'Сауатсыздықты жою қоғамы',
      '"Жас арбакештер" одағы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5095,
    text:
        'Сауатсыздықты жою мақсатында комсомол жастар белсене қатысқан қоғам:',
    options: [
      '"Қосшы одағы"',
      '"Алаш" партиясы',
      '"Үш жүз" партиясы',
      'Сауатсыздықты жою қоғамы'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5096,
    text: 'Сауатсыздықты жою қоғамы ұйымдастырылды:',
    options: ['1920 ж.', '1922 ж.', '1924 ж.', '1926 ж.'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5097,
    text: '1920 жылдары ашылған «Қызыл отаулардың» қызметі:',
    options: [
      'Орыс әйелдері арасындағы сауатсыздықты жою',
      'Қазақ әйелдері арасындағы сауатсыздықты жою',
      'Балалар арасындағы сауатсыздықты жою',
      'Жұмысшылар арасындағы сауатсыздықты жою'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5098,
    text: 'Қазақ тілді мектептерге арнап Алгебра оқулығын жазған:',
    options: [
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Қ.Сәтбаев',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5099,
    text: 'А.Байтұрсыновтың қазақ тілді мектептерге арнап жазған оқулығы:',
    options: ['"Маса"', '"Оян, қазақ!"', '"Сөз теориясы"', '"Қырық мысал"'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 100,
    text: '1924 жылы араб әрпінің негізінде жасалған қазақ әліпбиін жетілдірген:',
    options: [
      'С.Сейфуллин',
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'А.Байтұрсынов'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 101,
    text:
        'Қазақ әліпбиін жасау арқылы сауатсыздықты жою науқанына ерекше үлес қосқан тұлға:',
    options: [
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'А.Байтұрсынов',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 102,
    text: 'М.Дулатұлының қазақ тілді мектептерге арнап жазған оқулығы:',
    options: ['"Маса"', '"Оян, қазақ!"', '"Хрестоматия"', '"Қырық мысал"'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 103,
    text:
        'Ж.Аймауытовтың қазақ тілді мектептерге арнап жазған оқу құралы:',
    options: [
      '«Қазақ тілі»',
      '«Мектепте қызмет істейтіндер үшін педагогикалық нұсқаулық»',
      '«Әліппе»',
      '«Физика»'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 104,
    text:
        'ХХ ғасырдың 20 жылдары қазақ тілді мектептерге арнап география оқулығын жазған:',
    options: [
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 105,
    text: 'Қазақ әліпбиі латын әліпбиіне көшірілді:',
    options: ['1925 жылы', '1927 жылы', '1929 жылы', '1931 жылы'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 106,
    text: 'Қазақ әліпбиі кириллицаға көшірілді:',
    options: ['1936 жылы', '1938 жылы', '1940 жылы', '1942 жылы'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 107,
    text: 'Ұлы Отан соғысына дейін Қазақстанда пайдаланылған әліпби:',
    options: ['Тек араб', 'Тек латын', 'Араб, латын', 'Тек кириллица'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 108,
    text: 'ХХ ғасырдың 30 жылдары мектептердің ашылуына бөгет болған жағдай:',
    options: [
      'Мұғалімдердің жетіспеушілігі',
      'Оқулықтардың болмауы',
      'Елдегі аштық',
      'Соғыс қаупі'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 109,
    text:
        '1939 жылдан бастап мектептерде әскери іс пәнін оқыту себебі:',
    options: [
      'Мектеп бағдарламасына өзгеріс енгізілді',
      'Жалпыға ортақ әскери міндеткерлік енгізілген соң',
      'Мұғалімдердің талабы бойынша',
      'Оқушылардың қызығушылығы бойынша'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 110,
    text:
        '1939 жылы жалпыға ортақ әскери міндеткерлік енгізілгеннен кейін мектептерде оқытыла бастаған пән:',
    options: ['Алғашқы әскери дайындық', 'Әскери іс', 'Дене шынықтыру', 'Тарих'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 111,
    text:
        'Ұлы Отан соғысына дейін жоғары білімді мамандар оқып, білім алған қалалар:',
    options: [
      'Тек Алматы',
      'Тек Мәскеу',
      'Ленинград, Мәскеу, Ташкент',
      'Тек Қазақстан қалалары'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 112,
    text:
        '1920-1930 жылдары алғашқы жоғары оқу орындары негізінен осы қалада ашылды:',
    options: ['Орынбор', 'Семей', 'Алматы', 'Қызылорда'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 113,
    text:
        'Қазақстанда тұңғыш жоғары оқу орны - педагогикалық институт ашылды:',
    options: ['1926 ж.', '1928 ж.', '1930 ж.', '1932 ж.'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 114,
    text: 'Қазақстанда ашылған тұңғыш жоғары оқу орны:',
    options: [
      'Қазақ ұлттық университеті',
      'Қазақ мемлекеттік педагогикалық институт',
      'Қазақ ауыл шаруашылығы институты',
      'Алматы медицина институты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 115,
    text:
        '1928 жылы Қазақстанда ашылған педагогикалық институттың ерекшелігі:',
    options: [
      'Алғашқы медициналық оқу орны',
      'Алғашқы техникалық оқу орны',
      'Алғашқы ауылшаруашылық оқу орны',
      'Алғашқы жоғары оқу орны'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 116,
    text: 'Қазақстанда ашылған тұңғыш жоғары оқу орнының бағыты:',
    options: [
      'Медициналық',
      'Техникалық',
      'Ауылшаруашылық',
      'Педагогикалық'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 117,
    text: 'Ұлы ақын Абай Құнанбайұлының есімі берілген оқу орны:',
    options: [
      'Қазақ ұлттық университеті',
      'Қазақ педагогикалық институты',
      'Қазақ ауыл шаруашылығы институты',
      'Алматы медицина институты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 118,
    text:
        'Қазақстандағы жоғары оқу орындарын олардың ашылу жылдарына қарай дұрыс ретін анықтаңыз:\nҚазақ мемлекеттік университеті; 2. Алматы медициналық институты; 3. Алматы мал-дәрігерлік институты; 4) Қазақ ауылшаруашылық институты',
    options: ['1, 2, 3, 4', '4, 3, 2, 1', '3, 4, 2, 1', '2, 3, 4, 1'],
    correctOptionIndex: 2,
  ),
  Question(
      id: 119,
      text:
          'ХХ ғасырдың 20-30 жылдарында Қазақстан ғылымының тұңғыш төрағасы Кеңестік ірі түрколог, академик:',
      options: [
        'Қ.Сәтбаев',
        'А.Н.Самойлович',
        'С.Асфендияров',
        'М.Әуезов'
      ],
      correctOptionIndex: 1),
  Question(
    id: 120,
    text:
        '1935 жылы жарық көрген «Қазақстанның көне заманнан бергі тарихы» еңбегінің авторы:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'С.Асфендияров',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 121,
    text: 'Қазақ тіліндегі алғашқы «Қазақстан тарихы» оқулығының авторы:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'С.Асфендияров',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 122,
    text:
        'ХХ ғасырдың 20 жылдары профессор С.Асфендияровтың құрастырған оқулығы:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"Қазақстан географиясы"',
      '"Қазақстан тарихы"'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 123,
    text: 'Қазақ тіл білімінің дамуында жетекші орын иеленген профессор:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'Қ.Жұбанов',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 124,
    text:
        'Ғылымға сіңірген еңбегі үшін геология-минералогия ғылымдарының докторы атанған ғалым:',
    options: [
      'А.Байтұрсынов',
      'Қ.Жұбанов',
      'Қ.Сәтпаев',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 125,
    text: 'Қ.Сәтпаевтың зерттеген ғылым саласы:',
    options: ['Тарих', 'Әдебиет', 'Геология', 'Филология'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 126,
    text:
        '«Раушан коммунист», «Шұғаның белгісі», «Азамат Азаматыч» шығармаларының авторы:',
    options: [
      'М.Әуезов',
      'С.Мұқанов',
      'Б.Майлин',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 127,
    text:
        '«Қилы заман», «Хан Кене», «Қараш-Қараш оқиғасы» шығармаларының авторы:',
    options: [
      'С.Сейфуллин',
      'Б.Майлин',
      'М.Әуезов',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 128,
    text:
        'М.Әуезовтың жойылып бара жатқан салт-дәстүрлерді жаңғыртуға мүмкіндік берген өмірбаяндық романы:',
    options: ['"Қилы заман"', '"Абай жолы"', '"Қараш-Қараш"', '"Хан Кене"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 129,
    text:
        '«Қырғыз (қазақ) халқының 1000 әні» және «Қазақ халқының 500 әні мен күйі» деген жинақтар жариялады:',
    options: [
      'А.Затаевич',
      'Қ.Сәтбаев',
      'М.Әуезов',
      'Б.Майлин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
      id: 130,
      text: 'Әскери педагогика мен психологияға үлес қосқан дара тұлға:',
      options: [
        'Т.Бигелдинов',
        'Б.Момышұлы',
        'М.Мәметова',
        'Ә.Молдағұлова'
      ],
      correctOptionIndex: 1),
  Question(
    id: 131,
    text:
        'Полковник Ғани Сафиуллин бастаған 73-гвардиялық дивизия ерлік көрсетті:',
    options: [
      'Мәскеу түбінде',
      'Сталинград түбінде',
      'Курск шайқасында',
      'Берлин үшін шайқаста'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 132,
    text:
        'Ұлы Отан соғысы жылдары Невель қаласы үшін ұрыста ерлікпен қаза тапқан аға сержант, пулеметші:',
    options: [
      'Т.Бигелдинов',
      'Б.Момышұлы',
      'М.Мәметова',
      'Ә.Молдағұлова'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 133,
    text: 'М.Мәметова құрамында шайқасқан атқыштар бригадасы:',
    options: ['8-ші гвардиялық', '100-ші', '316-шы', '73-ші гвардиялық'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 134,
    text:
        'Ұлы Отан соғысы кезінде іске қосылған қара металлургиясының «тұңғышы» аталған зауыт:',
    options: [
      'Қарағанды металлургия зауыты',
      'Ақтөбе ферроқорытпа зауыты',
      'Жезқазған мыс комбинаты',
      'Балқаш мыс балқыту зауыты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 135,
    text:
        'Майданға қару-жарақ, көлік, киім-кешек, азық-түлікті жылдам жеткізу мақсатында салынған теміржол:',
    options: [
      'Түрксіб',
      'Қандыағаш-Орск',
      'Мойынты-Шу',
      'Ақмола-Қарталы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 136,
    text:
        'Жаппай қуғын-сүргін кезеңінде еркінен тыс мемлекеттен қуу, көшіру, жер аудару:',
    options: ['Репрессия', 'Депортация', 'Ассимиляция', 'Геноцид'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 137,
    text: 'Бір халықтың екінші халықпен араласып, ұлт ретінде сіңісіп кетуі:',
    options: ['Репрессия', 'Депортация', 'Ассимиляция', 'Геноцид'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 138,
    text:
        'Ұлы Отан соғысы жылдарында Қазақстанға Еділ бойынан көшіріліп әкелінгендер:',
    options: ['Шешендер', 'Ингуштар', 'Немістер', 'Қарашайлар'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 139,
    text:
        'Қуғын-сүргінге ұшыраған халық өкілдері ішінде неміс ұлтының өкілі, жазушы:',
    options: [
      'М.Әуезов',
      'Герольд Бельгер',
      'С.Мұқанов',
      'Ғ.Мүсірепов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 140,
    text:
        '1943-1944 жылдары Қазақстанға күштеп көшірілген Солтүстік Кавказ халықтарының өкілдері:',
    options: [
      'Қарашайлар, Балқарлар, Шешендер, Ингуштар',
      'Қырым татарлары, Қалмақтар',
      'Корейлер, Түріктер',
      'Гректер, Поляктар'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 141,
    text:
        'Қазақстан халқының Ассамблеясы бастамасымен қазақ халқына құрмет ретінде 1 наурызда атап өтілді:',
    options: [
      'Тәуелсіздік күні',
      'Конституция күні',
      'Алғыс айту күні',
      'Бірлік күні'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 142,
    text:
        'Қ.И.Сәтбаевқа 1942 жылы мемлекеттік сыйлық берілді:',
    options: [
      '"Абай жолы" романы үшін',
      'Жезқазған мыс кен орындарына сіңірген еңбегі үшін',
      'Қазақ тілі оқулығын жазғаны үшін',
      '"Қазақ КСР тарихы" еңбегі үшін'
    ],
    correctOptionIndex: 1,
  ),
    Question(
        id: 143,
        text: 'Ұлы Отан соғысы жылдарында Алматы қаласында ашылған жоғары оқу орны:',
        options: [
            'Қазақ ұлттық университеті',
            'Қазақ мемлекеттік педагогикалық институты',
            'Шет тілдер институты, Дене шынықтыру институты, Қыздар педагогикалық институты',
            'Қазақ ауыл шаруашылығы институты'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 144,
        text: 'Ұлы Отан соғысы жылдарында ашылған жоғары оқу орны:',
        options: [
            'Қазақ ұлттық университеті',
            'Алматы медицина институты',
            'Қазақ мемлекеттік консерваториясы',
            'Қазақ ауыл шаруашылығы институты'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 145,
        text: 'ХХ ғ. 40-жж. Қазақстанда ашылған жоғары оқу орны(-дары):',
        options: [
            'Қазақ ұлттық университеті',
            'Қазақ мемлекеттік қыздар педагогикалық институты, Шымкент технология институты, Алматы мемлекеттік шет тілдер институты',
            'Алматы медицина институты',
            'Қазақ ауыл шаруашылығы институты'
        ],
        correctOptionIndex: 1
    ),
    Question(
        id: 146,
        text: 'Ұлы Отан соғысы жылдары патриоттық тақырыпта жазылған Ж.Жабаевтың өлеңі:',
        options: [
            '"Оян, қазақ!"',
            '"Маса"',
            '"Ленинградтық өренім"',
            '"Қырық мысал"'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 147,
        text: 'Ұлы Отан соғысы жауынгерлерінің ерлігін жырлаған ақын:',
        options: [
            'Ж.Жабаев',
            'М.Әуезов',
            'С.Мұқанов',
            'Д.Ф.Снегин'
        ],
        correctOptionIndex: 3
    ),
    Question(
        id: 148,
        text: 'Ұлы Отан соғысы жылдарында Алматыға көшірілген киностудиялар:',
        options: [
            'Тек Мәскеу',
            'Тек Ленинград',
            'Мәскеу және Ленинград',
            'Киев және Одесса'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 149,
        text: 'Ұлы Отан соғысынан кейін ән айтып, өнер көрсеткен Халық артисі, Халық Қаһарманы:',
        options: [
            'К.Байсейітова',
            'Ш.Айманов',
            'Р.Бағланова',
            'Б.Төлегенова'
        ],
        correctOptionIndex: 2
    ),
  Question(
    id: 150,
    text: '1942 жылы «Гвардия, алға!» операсын қойған:',
    options: [
      'Композитор: А.Жұбанов',
      'Композитор: Е.Брусиловский',
      'Композитор: М.Төлебаев',
      'Композитор: Л.Хамиди'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 151,
    text: '18 мың шаршы километрдей жер бөліп берілген полигон:',
    options: ['Азғыр', 'Капустин Яр', 'Семей', 'Байқоңыр'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 152,
    text:
        'ХХ ғ. ІІ жартысында Павлодар, Қарағанды, Өскемен облыстарына экологиялық апат әкелді:',
    options: [
      'Арал теңізінің тартылуы',
      'Семей полигоны',
      'Балқаш көлінің ластануы',
      'Каспий теңізінің деңгейінің көтерілуі'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 153,
    text:
        '1999 жылы БҰҰ аясында Семейдегі сынақ салдары мәселелеріне арналған халықаралық конференция өтті:',
    options: ['Семейде', 'Алматыда', 'Мәскеуде', 'Токиода'],
    correctOptionIndex: 3,
  ),
  Question(
    id: 154,
    text:
        'ХХ ғ. 40-50 жылдардың басында Қазақстанда саяси қудалауға ұшыраған тарихшы:',
    options: [
      'Қ.Сәтбаев',
      'М.Әуезов',
      'Е.Бекмаханов',
      'С.Асфендияров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 155,
    text: 'ХХ ғ. 40-50 жылдары Қазақстандағы саяси қудалау шараларының бірі:',
    options: [
      '"Алаш ісі"',
      '"Бекмаханов ісі"',
      '"Үш жүз ісі"',
      '"Жас тұлпар ісі"'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 156,
    text:
        'ХХ ғ. 50-жылдары «Ленинград ісі», «Дәрігерлер ісі» сияқты Қазақстанда қолға алынған іс:',
    options: [
      '"Алаш ісі"',
      '"Бекмаханов ісі"',
      '"Үш жүз ісі"',
      '"Жас тұлпар ісі"'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 157,
    text: '1943 жылы Алматыда жарық көрген еңбек:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"Қазақ КСР тарихы"',
      '"Қазақстан географиясы"'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 158,
    text:
        '1943 жылы Алматыда жарық көрген «Қазақ КСР тарихы» атты көлемді еңбектің авторларының бірі:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'Е.Бекмаханов',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 159,
    text: '«ХІХ ғ. 20-40 жылдарындағы Қазақстан» деген монографиялық еңбектің авторы:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'Е.Бекмаханов',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 160,
    text: '1947 жылы Бекмахановтың жарық көрген еңбегі:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"ХІХ ғ. 20-40 жылдарындағы Қазақстан"',
      '"Қазақстан географиясы"'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 161,
    text:
        'Е.Бекмахановтың Кенесары Қасымұлы бастаған көтерілісі жайында жазылған монографиясы:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"ХІХ ғасырдың 20-40 жылдарындағы Қазақстан"',
      '"Қазақстан географиясы"'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 162,
    text:
        'Е.Бекмахановтың «ХІХ ғасырдың 20-40 жылдарындағы Қазақстан» деген еңбегінде қарастырылған негізгі мәселе:',
    options: [
      'Экономикалық даму',
      'Әлеуметтік жағдай',
      'Ұлт-азаттық күрес',
      'Мәдени өмір'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 163,
    text: 'ХХ ғ. 40-50 жылдары Мәскеуге кетуге мәжбүр болды:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'М.Әуезов',
      'С.Асфендияров'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 164,
    text:
        '«Едіге батыр» жырына алғы сөз жазғаны үшін «ұлтшыл» атанған ғалым:',
    options: [
      'Е.Бекмаханов',
      'Қ.Сәтбаев',
      'М.Әуезов',
      'С.Асфендияров'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 165,
    text: 'КОКП-ның XX съезінің маңызы:',
    options: [
      'Ұжымдастыруды қолдау',
      'Жеке адамға табынушылықты айыптау',
      'Индустрияландыруды жеделдету',
      'Жаңа экономикалық саясатты енгізу'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 166,
    text: 'КОКП XX съезінде қаралған ең басты мәселе:',
    options: [
      'Ұжымдастыру',
      'Индустрияландыру',
      'Сталиннің жеке басына табынуды айыптау',
      'Жаңа экономикалық саясат'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 167,
    text: '«Жеке адамға табынушылық және оның зардаптары» туралы қаулыдан кейін:',
    options: [
      'Ұжымдастыру басталды',
      'Индустрияландыру басталды',
      'Мемлекет қайраткерлері ақталды',
      'Жаңа экономикалық саясат енгізілді'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 168,
    text:
        'КОКП XX съезінен кейін ақталған, әділетсіз жазаға ұшыраған аса көрнекті әдебиетшілер:',
    options: [
      'М.Әуезов, Ғ.Мүсірепов',
      'С.Сейфуллин, І.Жансүгіров, Б.Майлин',
      'Қ.Сәтбаев, Е.Бекмаханов',
      'А.Байтұрсынов, М.Дулатұлы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
      id: 169,
      text:
          'Жеке бас құқығының бұзылуы, ұлт саясатын жүргізудегі әділетсіздіктер туралы Н.С.Хрущевке хат жазған Шығыс Қазақстан облысы, орыс тілі пәнінің мұғалімі, майдангер:',
      options: [
          'Қ.Сәтбаев',
          'Е.Бекмаханов',
          'М.Әуезов',
          'М.Елікбаев'
      ],
      correctOptionIndex: 3
  ),
  Question(
      id: 170,
      text: 'Тың игеру кезіндегі КСРО Компартиясының Бас хатшысы:',
    options: [
        'И.Сталин',
        'Л.Брежнев',
        'Н.Хрущев',
        'М.Горбачев'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5084,
    text: 'ХХ ғ.20-30 жылдарындағы мәдени революциялық шаралары:',
    options: [
      'Ақпан төңкерісі',
      'Қазан төңкерісі',
      'Бірінші орыс революциясы',
      'Азамат соғысы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5085,
    text:
        'Кеңес елінде сауатсыздықты жою жұмысының аталуы:',
    options: [
      'Ақпан төңкерісі',
      'Қазан төңкерісі',
      'Бірінші орыс революциясы',
      'Азамат соғысы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5086,
    text: 'Қазақстанда көрнекті қайраткерлерге қысым жасау саясатын бастады:',
    options: [
      'Ә.Бөкейханов, А.Байтұрсынов',
      'С.Сейфуллин, С.Меңдешов',
      'Т.Рысқұлов, Ә.Жангелдин',
      'Ф.Голощекин'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5087,
    text: 'Қазақ ауылының дәстүрлі әлеуметтік-шаруашылық құрылысын жойған саясаткер:',
    options: [
      'Ф.Голощекин',
      'С.Сейфуллин',
      'Т.Рысқұлов',
      'Ә.Жангелдин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5088,
    text: '1927 жылы БК(б)П-ның ХV съезінде қабылданған шешім:',
    options: [
      'Индустрияландыру',
      'Ұжымдастыру',
      'Жаңа экономикалық саясат',
      'Мәдени революция'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5089,
    text:
        '1929 жылы Қазақстанда 40 миллионнан астам мал болса, 1933 жылы 4,5 млн-ға азаюына себеп болған саясат:',
    options: [
      'Индустрияландыру',
      'Ұжымдастыру',
      'Жаңа экономикалық саясат',
      'Соғыс'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5090,
    text:
        'Ұлы Отан соғысына дейінгі жылдарындағы Қазақстанда маңызды мәдени өзгерістердің бірі:',
    options: [
      'Халықты жаппай сауаттандыру',
      'Жоғары оқу орындарын ашу',
      'Ғылыми зерттеулер жүргізу',
      'Өнеркәсіпті дамыту'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 5091,
    text:
        '1918 жылы «Бірыңғай еңбек мектептері туралы» ережесіне сәйкес ашылған оқу орны:',
    options: [
      '3 сатылы бірыңғай еңбек мектептері',
      '2 сатылы бірыңғай еңбек мектептері',
      'Жоғары оқу орындары',
      'Арнаулы орта оқу орындары'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 92,
    text: '1919 жылы Халық Комиссарлары Кеңесі (ХКК) қол қойған декрет:',
    options: [
      'Жер туралы',
      'Бейбітшілік туралы',
      'Сауатсыздықты жою туралы',
      'Ұлттар туралы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 93,
    text: 'ХХ ғасыр басында сауатсыздықты жою күресінде жұмыс істеген білім ошақтары:',
    options: [
      '"Жас қазақ"',
      '"Қызыл отау"',
      '"Қосшы одағы"',
      '"Алаш" партиясы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 5094,
    text:
        'Халық бұқарасының мәдени деңгейін көтеру мақсатында 1924 жылы ұйымдастырылған қоғам:',
    options: [
      '"Алаш" партиясы',
      '"Үш жүз" партиясы',
      'Сауатсыздықты жою қоғамы',
      '"Жас арбакештер" одағы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5095,
    text:
        'Сауатсыздықты жою мақсатында комсомол жастар белсене қатысқан қоғам:',
    options: [
      '"Қосшы одағы"',
      '"Алаш" партиясы',
      '"Үш жүз" партиясы',
      'Сауатсыздықты жою қоғамы'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 5096,
    text: 'Сауатсыздықты жою қоғамы ұйымдастырылды:',
    options: ['1920 ж.', '1922 ж.', '1924 ж.', '1926 ж.'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 5097,
    text: '1920 жылдары ашылған «Қызыл отаулардың» қызметі:',
    options: [
      'Орыс әйелдері арасындағы сауатсыздықты жою',
      'Қазақ әйелдері арасындағы сауатсыздықты жою',
      'Балалар арасындағы сауатсыздықты жою',
      'Жұмысшылар арасындағы сауатсыздықты жою'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 98,
    text: 'Қазақ тілді мектептерге арнап Алгебра оқулығын жазған:',
    options: [
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Қ.Сәтбаев',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 99,
    text: 'А.Байтұрсыновтың қазақ тілді мектептерге арнап жазған оқулығы:',
    options: ['"Маса"', '"Оян, қазақ!"', '"Сөз теориясы"', '"Қырық мысал"'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 100,
    text: '1924 жылы араб әрпінің негізінде жасалған қазақ әліпбиін жетілдірген:',
    options: [
      'С.Сейфуллин',
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'А.Байтұрсынов'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 101,
    text:
        'Қазақ әліпбиін жасау арқылы сауатсыздықты жою науқанына ерекше үлес қосқан тұлға:',
    options: [
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'А.Байтұрсынов',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 102,
    text: 'М.Дулатұлының қазақ тілді мектептерге арнап жазған оқулығы:',
    options: ['"Маса"', '"Оян, қазақ!"', '"Хрестоматия"', '"Қырық мысал"'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 103,
    text:
        'Ж.Аймауытовтың қазақ тілді мектептерге арнап жазған оқу құралы:',
    options: [
      '«Қазақ тілі»',
      '«Мектепте қызмет істейтіндер үшін педагогикалық нұсқаулық»',
      '«Әліппе»',
      '«Физика»'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 104,
    text:
        'ХХ ғасырдың 20 жылдары қазақ тілді мектептерге арнап география оқулығын жазған:',
    options: [
      'А.Байтұрсынов',
      'М.Дулатұлы',
      'Ә.Бөкейхан',
      'Ж.Аймауытов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 105,
    text: 'Қазақ әліпбиі латын әліпбиіне көшірілді:',
    options: ['1925 жылы', '1927 жылы', '1929 жылы', '1931 жылы'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 106,
    text: 'Қазақ әліпбиі кириллицаға көшірілді:',
    options: ['1936 жылы', '1938 жылы', '1940 жылы', '1942 жылы'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 107,
    text: 'Ұлы Отан соғысына дейін Қазақстанда пайдаланылған әліпби:',
    options: ['Тек араб', 'Тек латын', 'Араб, латын', 'Тек кириллица'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 108,
    text: 'ХХ ғасырдың 30 жылдары мектептердің ашылуына бөгет болған жағдай:',
    options: [
      'Мұғалімдердің жетіспеушілігі',
      'Оқулықтардың болмауы',
      'Елдегі аштық',
      'Соғыс қаупі'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 109,
    text:
        '1939 жылдан бастап мектептерде әскери іс пәнін оқыту себебі:',
    options: [
      'Мектеп бағдарламасына өзгеріс енгізілді',
      'Жалпыға ортақ әскери міндеткерлік енгізілген соң',
      'Мұғалімдердің талабы бойынша',
      'Оқушылардың қызығушылығы бойынша'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 110,
    text:
        '1939 жылы жалпыға ортақ әскери міндеткерлік енгізілгеннен кейін мектептерде оқытыла бастаған пән:',
    options: ['Алғашқы әскери дайындық', 'Әскери іс', 'Дене шынықтыру', 'Тарих'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 111,
    text:
        'Ұлы Отан соғысына дейін жоғары білімді мамандар оқып, білім алған қалалар:',
    options: [
      'Тек Алматы',
      'Тек Мәскеу',
      'Ленинград, Мәскеу, Ташкент',
      'Тек Қазақстан қалалары'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 112,
    text:
        '1920-1930 жылдары алғашқы жоғары оқу орындары негізінен осы қалада ашылды:',
    options: ['Орынбор', 'Семей', 'Алматы', 'Қызылорда'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 113,
    text:
        'Қазақстанда тұңғыш жоғары оқу орны - педагогикалық институт ашылды:',
    options: ['1926 ж.', '1928 ж.', '1930 ж.', '1932 ж.'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 114,
    text: 'Қазақстанда ашылған тұңғыш жоғары оқу орны:',
    options: [
      'Қазақ ұлттық университеті',
      'Қазақ мемлекеттік педагогикалық институт',
      'Қазақ ауыл шаруашылығы институты',
      'Алматы медицина институты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 115,
    text:
        '1928 жылы Қазақстанда ашылған педагогикалық институттың ерекшелігі:',
    options: [
      'Алғашқы медициналық оқу орны',
      'Алғашқы техникалық оқу орны',
      'Алғашқы ауылшаруашылық оқу орны',
      'Алғашқы жоғары оқу орны'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 116,
    text: 'Қазақстанда ашылған тұңғыш жоғары оқу орнының бағыты:',
    options: [
      'Медициналық',
      'Техникалық',
      'Ауылшаруашылық',
      'Педагогикалық'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 117,
    text: 'Ұлы ақын Абай Құнанбайұлының есімі берілген оқу орны:',
    options: [
      'Қазақ ұлттық университеті',
      'Қазақ педагогикалық институты',
      'Қазақ ауыл шаруашылығы институты',
      'Алматы медицина институты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 118,
    text:
        'Қазақстандағы жоғары оқу орындарын олардың ашылу жылдарына қарай дұрыс ретін анықтаңыз:\nҚазақ мемлекеттік университеті; 2. Алматы медициналық институты; 3. Алматы мал-дәрігерлік институты; 4) Қазақ ауылшаруашылық институты',
    options: ['1, 2, 3, 4', '4, 3, 2, 1', '3, 4, 2, 1', '2, 3, 4, 1'],
    correctOptionIndex: 2,
  ),
  Question(
      id: 119,
      text:
          'ХХ ғасырдың 20-30 жылдарында Қазақстан ғылымының тұңғыш төрағасы Кеңестік ірі түрколог, академик:',
      options: [
        'Қ.Сәтбаев',
        'А.Н.Самойлович',
        'С.Асфендияров',
        'М.Әуезов'
      ],
      correctOptionIndex: 1),
  Question(
    id: 120,
    text:
        '1935 жылы жарық көрген «Қазақстанның көне заманнан бергі тарихы» еңбегінің авторы:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'С.Асфендияров',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 121,
    text: 'Қазақ тіліндегі алғашқы «Қазақстан тарихы» оқулығының авторы:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'С.Асфендияров',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 122,
    text:
        'ХХ ғасырдың 20 жылдары профессор С.Асфендияровтың құрастырған оқулығы:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"Қазақстан географиясы"',
      '"Қазақстан тарихы"'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 123,
    text: 'Қазақ тіл білімінің дамуында жетекші орын иеленген профессор:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'Қ.Жұбанов',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 124,
    text:
        'Ғылымға сіңірген еңбегі үшін геология-минералогия ғылымдарының докторы атанған ғалым:',
    options: [
      'А.Байтұрсынов',
      'Қ.Жұбанов',
      'Қ.Сәтпаев',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 125,
    text: 'Қ.Сәтпаевтың зерттеген ғылым саласы:',
    options: ['Тарих', 'Әдебиет', 'Геология', 'Филология'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 126,
    text:
        '«Раушан коммунист», «Шұғаның белгісі», «Азамат Азаматыч» шығармаларының авторы:',
    options: [
      'М.Әуезов',
      'С.Мұқанов',
      'Б.Майлин',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 127,
    text:
        '«Қилы заман», «Хан Кене», «Қараш-Қараш оқиғасы» шығармаларының авторы:',
    options: [
      'С.Сейфуллин',
      'Б.Майлин',
      'М.Әуезов',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 128,
    text:
        'М.Әуезовтың жойылып бара жатқан салт-дәстүрлерді жаңғыртуға мүмкіндік берген өмірбаяндық романы:',
    options: ['"Қилы заман"', '"Абай жолы"', '"Қараш-Қараш"', '"Хан Кене"'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 129,
    text:
        '«Қырғыз (қазақ) халқының 1000 әні» және «Қазақ халқының 500 әні мен күйі» деген жинақтар жариялады:',
    options: [
      'А.Затаевич',
      'Қ.Сәтбаев',
      'М.Әуезов',
      'Б.Майлин'
    ],
    correctOptionIndex: 0,
  ),
  Question(
      id: 130,
      text: 'Әскери педагогика мен психологияға үлес қосқан дара тұлға:',
      options: [
        'Т.Бигелдинов',
        'Б.Момышұлы',
        'М.Мәметова',
        'Ә.Молдағұлова'
      ],
      correctOptionIndex: 1),
  Question(
    id: 131,
    text:
        'Полковник Ғани Сафиуллин бастаған 73-гвардиялық дивизия ерлік көрсетті:',
    options: [
      'Мәскеу түбінде',
      'Сталинград түбінде',
      'Курск шайқасында',
      'Берлин үшін шайқаста'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 132,
    text:
        'Ұлы Отан соғысы жылдары Невель қаласы үшін ұрыста ерлікпен қаза тапқан аға сержант, пулеметші:',
    options: [
      'Т.Бигелдинов',
      'Б.Момышұлы',
      'М.Мәметова',
      'Ә.Молдағұлова'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 133,
    text: 'М.Мәметова құрамында шайқасқан атқыштар бригадасы:',
    options: ['8-ші гвардиялық', '100-ші', '316-шы', '73-ші гвардиялық'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 134,
    text:
        'Ұлы Отан соғысы кезінде іске қосылған қара металлургиясының «тұңғышы» аталған зауыт:',
    options: [
      'Қарағанды металлургия зауыты',
      'Ақтөбе ферроқорытпа зауыты',
      'Жезқазған мыс комбинаты',
      'Балқаш мыс балқыту зауыты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 135,
    text:
        'Майданға қару-жарақ, көлік, киім-кешек, азық-түлікті жылдам жеткізу мақсатында салынған теміржол:',
    options: [
      'Түрксіб',
      'Қандыағаш-Орск',
      'Мойынты-Шу',
      'Ақмола-Қарталы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 136,
    text:
        'Жаппай қуғын-сүргін кезеңінде еркінен тыс мемлекеттен қуу, көшіру, жер аудару:',
    options: ['Репрессия', 'Депортация', 'Ассимиляция', 'Геноцид'],
    correctOptionIndex: 1,
  ),
  Question(
    id: 137,
    text: 'Бір халықтың екінші халықпен араласып, ұлт ретінде сіңісіп кетуі:',
    options: ['Репрессия', 'Депортация', 'Ассимиляция', 'Геноцид'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 138,
    text:
        'Ұлы Отан соғысы жылдарында Қазақстанға Еділ бойынан көшіріліп әкелінгендер:',
    options: ['Шешендер', 'Ингуштар', 'Немістер', 'Қарашайлар'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 139,
    text:
        'Қуғын-сүргінге ұшыраған халық өкілдері ішінде неміс ұлтының өкілі, жазушы:',
    options: [
      'М.Әуезов',
      'Герольд Бельгер',
      'С.Мұқанов',
      'Ғ.Мүсірепов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 140,
    text:
        '1943-1944 жылдары Қазақстанға күштеп көшірілген Солтүстік Кавказ халықтарының өкілдері:',
    options: [
      'Қарашайлар, Балқарлар, Шешендер, Ингуштар',
      'Қырым татарлары, Қалмақтар',
      'Корейлер, Түріктер',
      'Гректер, Поляктар'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 141,
    text:
        'Қазақстан халқының Ассамблеясы бастамасымен қазақ халқына құрмет ретінде 1 наурызда атап өтілді:',
    options: [
      'Тәуелсіздік күні',
      'Конституция күні',
      'Алғыс айту күні',
      'Бірлік күні'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 142,
    text:
        'Қ.И.Сәтбаевқа 1942 жылы мемлекеттік сыйлық берілді:',
    options: [
      '"Абай жолы" романы үшін',
      'Жезқазған мыс кен орындарына сіңірген еңбегі үшін',
      'Қазақ тілі оқулығын жазғаны үшін',
      '"Қазақ КСР тарихы" еңбегі үшін'
    ],
    correctOptionIndex: 1,
  ),
    Question(
        id: 143,
        text: 'Ұлы Отан соғысы жылдарында Алматы қаласында ашылған жоғары оқу орны:',
        options: [
            'Қазақ ұлттық университеті',
            'Қазақ мемлекеттік педагогикалық институты',
            'Шет тілдер институты, Дене шынықтыру институты, Қыздар педагогикалық институты',
            'Қазақ ауыл шаруашылығы институты'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 144,
        text: 'Ұлы Отан соғысы жылдарында ашылған жоғары оқу орны:',
        options: [
            'Қазақ ұлттық университеті',
            'Алматы медицина институты',
            'Қазақ мемлекеттік консерваториясы',
            'Қазақ ауыл шаруашылығы институты'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 145,
        text: 'ХХ ғ. 40-жж. Қазақстанда ашылған жоғары оқу орны(-дары):',
        options: [
            'Қазақ ұлттық университеті',
            'Қазақ мемлекеттік қыздар педагогикалық институты, Шымкент технология институты, Алматы мемлекеттік шет тілдер институты',
            'Алматы медицина институты',
            'Қазақ ауыл шаруашылығы институты'
        ],
        correctOptionIndex: 1
    ),
    Question(
        id: 146,
        text: 'Ұлы Отан соғысы жылдары патриоттық тақырыпта жазылған Ж.Жабаевтың өлеңі:',
        options: [
            '"Оян, қазақ!"',
            '"Маса"',
            '"Ленинградтық өренім"',
            '"Қырық мысал"'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 147,
        text: 'Ұлы Отан соғысы жауынгерлерінің ерлігін жырлаған ақын:',
        options: [
            'Ж.Жабаев',
            'М.Әуезов',
            'С.Мұқанов',
            'Д.Ф.Снегин'
        ],
        correctOptionIndex: 3
    ),
    Question(
        id: 148,
        text: 'Ұлы Отан соғысы жылдарында Алматыға көшірілген киностудиялар:',
        options: [
            'Тек Мәскеу',
            'Тек Ленинград',
            'Мәскеу және Ленинград',
            'Киев және Одесса'
        ],
        correctOptionIndex: 2
    ),
    Question(
        id: 149,
        text: 'Ұлы Отан соғысынан кейін ән айтып, өнер көрсеткен Халық артисі, Халық Қаһарманы:',
        options: [
            'К.Байсейітова',
            'Ш.Айманов',
            'Р.Бағланова',
            'Б.Төлегенова'
        ],
        correctOptionIndex: 2
    ),
  Question(
    id: 150,
    text: '1942 жылы «Гвардия, алға!» операсын қойған:',
    options: [
      'Композитор: А.Жұбанов',
      'Композитор: Е.Брусиловский',
      'Композитор: М.Төлебаев',
      'Композитор: Л.Хамиди'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 151,
    text: '18 мың шаршы километрдей жер бөліп берілген полигон:',
    options: ['Азғыр', 'Капустин Яр', 'Семей', 'Байқоңыр'],
    correctOptionIndex: 2,
  ),
  Question(
    id: 152,
    text:
        'ХХ ғ. ІІ жартысында Павлодар, Қарағанды, Өскемен облыстарына экологиялық апат әкелді:',
    options: [
      'Арал теңізінің тартылуы',
      'Семей полигоны',
      'Балқаш көлінің ластануы',
      'Каспий теңізінің деңгейінің көтерілуі'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 153,
    text:
        '1999 жылы БҰҰ аясында Семейдегі сынақ салдары мәселелеріне арналған халықаралық конференция өтті:',
    options: ['Семейде', 'Алматыда', 'Мәскеуде', 'Токиода'],
    correctOptionIndex: 3,
  ),
  Question(
    id: 154,
    text:
        'ХХ ғ. 40-50 жылдардың басында Қазақстанда саяси қудалауға ұшыраған тарихшы:',
    options: [
      'Қ.Сәтбаев',
      'М.Әуезов',
      'Е.Бекмаханов',
      'С.Асфендияров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 155,
    text: 'ХХ ғ. 40-50 жылдары Қазақстандағы саяси қудалау шараларының бірі:',
    options: [
      '"Алаш ісі"',
      '"Бекмаханов ісі"',
      '"Үш жүз ісі"',
      '"Жас тұлпар ісі"'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 156,
    text:
        'ХХ ғ. 50-жылдары «Ленинград ісі», «Дәрігерлер ісі» сияқты Қазақстанда қолға алынған іс:',
    options: [
      '"Алаш ісі"',
      '"Бекмаханов ісі"',
      '"Үш жүз ісі"',
      '"Жас тұлпар ісі"'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 157,
    text: '1943 жылы Алматыда жарық көрген еңбек:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"Қазақ КСР тарихы"',
      '"Қазақстан географиясы"'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 158,
    text:
        '1943 жылы Алматыда жарық көрген «Қазақ КСР тарихы» атты көлемді еңбектің авторларының бірі:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'Е.Бекмаханов',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 159,
    text: '«ХІХ ғ. 20-40 жылдарындағы Қазақстан» деген монографиялық еңбектің авторы:',
    options: [
      'Қ.Сәтбаев',
      'А.Байтұрсынов',
      'Е.Бекмаханов',
      'М.Әуезов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 160,
    text: '1947 жылы Бекмахановтың жарық көрген еңбегі:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"ХІХ ғ. 20-40 жылдарындағы Қазақстан"',
      '"Қазақстан географиясы"'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 161,
    text:
        'Е.Бекмахановтың Кенесары Қасымұлы бастаған көтерілісі жайында жазылған монографиясы:',
    options: [
      '"Қазақ әдебиеті"',
      '"Қазақ тілі"',
      '"ХІХ ғасырдың 20-40 жылдарындағы Қазақстан"',
      '"Қазақстан географиясы"'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 162,
    text:
        'Е.Бекмахановтың «ХІХ ғасырдың 20-40 жылдарындағы Қазақстан» деген еңбегінде қарастырылған негізгі мәселе:',
    options: [
      'Экономикалық даму',
      'Әлеуметтік жағдай',
      'Ұлт-азаттық күрес',
      'Мәдени өмір'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 163,
    text: 'ХХ ғ. 40-50 жылдары Мәскеуге кетуге мәжбүр болды:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'М.Әуезов',
      'С.Асфендияров'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 164,
    text:
        '«Едіге батыр» жырына алғы сөз жазғаны үшін «ұлтшыл» атанған ғалым:',
    options: [
      'Е.Бекмаханов',
      'Қ.Сәтбаев',
      'М.Әуезов',
      'С.Асфендияров'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 165,
    text: 'КОКП-ның XX съезінің маңызы:',
    options: [
      'Ұжымдастыруды қолдау',
      'Жеке адамға табынушылықты айыптау',
      'Индустрияландыруды жеделдету',
      'Жаңа экономикалық саясатты енгізу'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 166,
    text: 'КОКП XX съезінде қаралған ең басты мәселе:',
    options: [
      'Ұжымдастыру',
      'Индустрияландыру',
      'Сталиннің жеке басына табынуды айыптау',
      'Жаңа экономикалық саясат'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 167,
    text: '«Жеке адамға табынушылық және оның зардаптары» туралы қаулыдан кейін:',
    options: [
      'Ұжымдастыру басталды',
      'Индустрияландыру басталды',
      'Мемлекет қайраткерлері ақталды',
      'Жаңа экономикалық саясат енгізілді'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 168,
    text:
        'КОКП XX съезінен кейін ақталған, әділетсіз жазаға ұшыраған аса көрнекті әдебиетшілер:',
    options: [
      'М.Әуезов, Ғ.Мүсірепов',
      'С.Сейфуллин, І.Жансүгіров, Б.Майлин',
      'Қ.Сәтбаев, Е.Бекмаханов',
      'А.Байтұрсынов, М.Дулатұлы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
      id: 169,
      text:
          'Жеке бас құқығының бұзылуы, ұлт саясатын жүргізудегі әділетсіздіктер туралы Н.С.Хрущевке хат жазған Шығыс Қазақстан облысы, орыс тілі пәнінің мұғалімі, майдангер:',
      options: [
          'Қ.Сәтбаев',
          'Е.Бекмаханов',
          'М.Әуезов',
          'М.Елікбаев'
      ],
      correctOptionIndex: 3
  ),
  Question(
      id: 170,
      text: 'Тың игеру кезіндегі КСРО Компартиясының Бас хатшысы:',
    options: [
        'И.Сталин',
        'Л.Брежнев',
        'Н.Хрущев',
        'М.Горбачев'
    ],
    correctOptionIndex: 2,
  ),
 ];