import 'question.dart';

final List<Question> fourthChapterQuestions = [
  Question(
    id: 4001,
    text: "1867-1868 жылғы «Ережелерге» сәйкес Иранмен, Қытаймен дипломатиялық келіссөз жүргізуге рұқсат берген әкімшілік:",
    options: [
      "Орынбор генерал-губернаторлығы",
      "Батыс Сібір генерал-губернаторлығы",
      "Түркістан генерал-губернаторлығы",
      "Ішкі істер министрлігі",
    ],
    correctOptionIndex: 2,
  ),
  Question(
      id: 4002,
      text:
          "1867-1868 жылдардағы реформа бойынша облыстарды генерал-губернаторлықпен сәйкестендіріңіз: 1)Орал, Торғай, 2) Ақмола, Семей, 3) Жетісу, Сырдария А) Түркістан, Ә) Орынбор, Б) Батыс Сібір Жауабы: A) 1-А, 2-Ә, 3-Б B) 1-Ә, 2-Б, 3-А C) 1-Б, 2-А, 3-Ә D) 1-А, 2-Б, 3-Ә",
      options: [
        "1-А, 2-Ә, 3-Б",
        "1-Ә, 2-Б, 3-А",
        "1-Б, 2-А, 3-Ә",
        "1-А, 2-Б, 3-Ә"
      ],
      correctOptionIndex: 1),
  Question(
    id: 4003,
    text: "1867-1868 жылғы реформа бойынша Орал облысына енген уездер:",
    options: [
      "Орынбор, Ор, Елек",
      "Гурьев, Калмыков, Орал, Ембі",
      "Торғай, Ырғыз, Николаев",
      "Ақмола, Көкшетау, Омбы",
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 189,
    text: "1867-1868 жылғы реформа бойынша Торғай облысына енген уездер:",
    options: [
      "Орынбор, Ор, Елек",
      "Гурьев, Калмыков, Орал",
      "Елек, Ырғыз, Николаев, Торғай",
      "Ақмола, Көкшетау, Омбы",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 190,
    text: "1867-1868 жж. Реформа бойынша Ақмола облысына енген уездер:",
    options: [
      "Семей, Павлодар, Өскемен",
      "Қарқаралы, Зайсан, Көкпекті",
      "Ақмола, Көкшетау, Омбы, Петропавл",
      "Орал, Гурьев, Ембі",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 191,
    text: "1867-1868 жылғы реформа бойынша Семей облысына енген уездер:",
    options: [
      "Ақмола, Көкшетау, Омбы",
      "Қарқаралы, Өскемен, Павлодар, Семей",
      "Орал, Гурьев, Ембі",
      "Торғай, Ырғыз, Николаев",
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 192,
    text: "1867-1868 жж. реформасынан кейін әкімшілік аумақтық бөлініс:",
    options: [
      "Облыс, уезд, ауыл",
      "Генерал-губернатор, облыс, уезд, ауыл",
      "Генерал-губернатор, облыс, уезд, болыс, ауыл",
      "Губернатор, уезд, болыс",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 193,
    text: "1867-1868 жылғы «Ереже» бойынша облысты басқарды:",
    options: [
      "Губернатор",
      "Әскери губернатор",
      "Уезд бастығы",
      "Болыс",
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 194,
    text: "1867-1868 жылғы «Ереже» бойынша облыстар бөлінген әкімшілік буыны:",
    options: [
      "Ауыл",
      "Болыс",
      "Уезд",
      "Округ",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 195,
    text: "1867-1868 жж. Реформа бойынша уездер аймақтық принципке негізделіп бөлінді:",
    options: [
      "Ауылдарға",
      "Болысқа",
      "Округтерге",
      "Облыстарға",
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 196,
    text: "1867-1868 жылғы «Ереже» бойынша болысты басқарды:",
    options: [
      "Ақсақал",
      "Би",
      "Болыстық сұлтандар",
      "Ауыл старшыны",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 197,
    text: "1867-1868 жылдардағы реформа негізінде басқарудың ең төменгі сатысы:",
    options: [
      "Уезд",
      "Болыс",
      "Ауыл",
      "Облыс",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 198,
    text: "1867-1868 жылғы «Ереже» бойынша ауылды басқарды:",
    options: [
      "Би",
      "Ақсақал",
      "Ауыл старшындары",
      "Болыс",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 199,
    text: "1867-1868 ж.ж. Реформа бойынша қазақтарға рұқсат етілген қызмет түрлері:",
    options: [
      "Тек ауыл старшындары",
      "Тек болыстар",
      "Болыс және ауыл старшындары",
      "Уезд бастықтары",
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 200,
    text: "Ауыл старшындары мен болыстар іріктеліп алынды:",
    options: [
      "Тек қарапайым халықтан",
      "Тек бай-шонжарлардан",
      "Ақсүйек топтардан",
      "Барлық халықтың ішінен",
    ],
    correctOptionIndex: 2,
  ),
  Question(
      id: 201,
      text:
          "1867-1868 жылдардағы реформа негізінде Шыңғыс тұқымы сұлтандарына берілген жеңілдік:",
      options: [
        "Жер иелену құқығы",
        "Салықтардан босатылды",
        "Әскери қызметтен босатылды",
        "Ерекше сот құқығы"
      ],
      correctOptionIndex: 1),
  Question(
    id: 202,
    text: "1867-1868 жылдардағы реформалардың мақсаты:",
    options: [
      "Қазақтардың жағдайын жақсарту",
      "Сауданы дамыту",
      "Сұлтандар билігін жою",
      "Әскери басқаруды енгізу",
    ],
    correctOptionIndex: 2,
  ),
  Question(
      id: 203,
      text: "1867-1868 жылдардағы әкімшілік реформалардың жағымсыз тұстарының бірі:",
      options: [
        "Салықтың көбеюі",
        "Жердің тартып алынуы",
        "Дәстүрлі билер соты құқықтарының қысқартылуы",
        "Барлығы дұрыс"
      ],
      correctOptionIndex: 3),
  Question(
      id: 204,
      text: "1867-1868 жылғы «Ережелердің» ең басты ауыртпалықтары:",
      options: [
        "Салықтың көбеюі",
        "Қазақ жері Ресей үкіметінің меншігі болып жарияланды",
        "Әскери міндеткерліктің енгізілуі",
        "Діни қысымның күшеюі"
      ],
      correctOptionIndex: 1),
  Question(
      id: 205,
      text: "1867-1868 жылдары енгізілген реформа негізінде салық түрі:",
      options: [
        "Жер салығы",
        "Мал салығы",
        "«Түтін (шаңырақ) салығы»",
        "Кеден салығы"
      ],
      correctOptionIndex: 2),
  Question(
      id: 206,
      text:
          "1867-1868 жылдары реформа қазақтарға жерге байланысты рұқсат етілген шара:",
      options: [
        "Жерді жеке меншікке алу",
        "Жерді сату",
        "Қазақтардың жерлерінен қоныс аударуына және жерлерін жалға беруге",
        "Жерді шетелдіктерге сату"
      ],
      correctOptionIndex: 2),
  Question(
      id: 207,
      text:
          "1868 жылы Орал, Торғай көтерілісшілері мен фон Штемпель басқарған жазалаушы әскері арасында шайқас өткен жер:",
      options: [
        "Тастөбе",
        "Ақбұлақ",
        "Жамансай көлі маңында",
        "Қиыл"
      ],
      correctOptionIndex: 2),
  Question(
      id: 208,
      text:
          "1868-1869 жылдардағы Орал, Торғай көтерілісін жаншуға жіберген жазалаушы отрядты басқарған подполковник:",
      options: [
        "Веревкин",
        "Рукин",
        "Черняев",
        "Карелин"
      ],
      correctOptionIndex: 1),
  Question(
      id: 209,
      text: "1868-1869 жылдары Орал мен Торғайдағы халық қозғалысын басқарғандар:",
      options: [
        "Хандар мен сұлтандар",
        "Билер мен батырлар",
        "Ру басылары",
        "Діни қайраткерлер"
      ],
      correctOptionIndex: 2),
  Question(
      id: 210,
      text:
          "1867-1868 жылғы Жаңа ереже енгізілгеннен кейін Маңғыстау түбегіндегі адайларда қатты шиеленісіп кетті:",
      options: [
        "Салық мәселесі",
        "Жер мәселесі",
        "Діни мәселе",
        "Әскери міндеткерлік"
      ],
      correctOptionIndex: 1),
  Question(
      id: 211,
      text:
          "1870 жылы реформа қиыншылығына байланысты Маңғыстауда көтеріліске шыққан ру:",
      options: [
        "Табын",
        "Шеркеш",
        "Адай",
        "Беріш"
      ],
      correctOptionIndex: 2),
  Question(
      id: 212,
      text: "1870 жылы Маңғыстаудағы көтерілістің басшылары:",
      options: [
        "Сырым Датұлы, Исатай Тайманұлы",
        "Жанқожа Нұрмұхамедұлы, Есет Көтібарұлы",
        "Иса Тіленбайұлы, Досан Тәжіұлы",
        "Жоламан Тіленшіұлы, Ағыбай батыр"
      ],
      correctOptionIndex: 2),
  Question(
      id: 213,
      text:
          "1870 жылы Маңғыстау көтерілісі кезінде Досан Тәжіұлы, Иса Тіленбайұлы қарулы қол жинаған жер:",
      options: [
        "Үстірт",
        "Бозашы",
        "Самарқанд",
        "Жем"
      ],
      correctOptionIndex: 1),
  Question(
      id: 214,
      text:
          "1870 жылы Маңғыстау көтерілісі кезінде қазақ шаруаларының рухын көтерген оқиға:",
      options: [
        "Жанқожа батырдың көмекке келуі",
        "Подполковник Рукиннің отрядының талқандалуы",
        "Хиуа хандығының қолдауы",
        "Қоқан хандығының көмегі"
      ],
      correctOptionIndex: 1),
  Question(
      id: 215,
      text: "ХІХ ғасырда қазақтар флотилия құрып соғысқан көтеріліс:",
      options: [
        "Сырым Датұлы көтерілісі",
        "Исатай-Махамбет көтерілісі",
        "Кенесары Қасымұлы көтерілісі",
        "Маңғыстау көтерілісі"
      ],
      correctOptionIndex: 3),
  Question(
      id: 216,
      text: "1870 жылы сәуір айында Маңғыстау көтерілісшілері шабуыл жасады:",
      options: [
        "Орынбор бекінісіне",
        "Александровск фортына",
        "Ор бекінісіне",
        "Троицк бекінісіне"
      ],
      correctOptionIndex: 1),
  Question(
      id: 217,
      text:
          "1870 жылы мамырда Маңғыстаудағы көтерілісті басу үшін қосымша жазалаушы келді:",
      options: [
        "Орынбордан",
        "Сібірден",
        "Кавказдан",
        "Астраханнан"
      ],
      correctOptionIndex: 2),
  Question(
      id: 218,
      text:
          "Маңғыстаудағы 1870 жылғы көтеріліс жеңілгеннен кейін, көтерілісшілердің бір бөлігі өтіп кетті:",
      options: ["Ресейге", "Қытайға", "Хиуа хандығына", "Бұхар хандығына"],
      correctOptionIndex: 2),
  Question(
      id: 219,
      text: "1886 жылы маусымда қабылданған Ереженің атауы:",
      options: [
        "\"Сібір қазақтары туралы Ереже\"",
        "\"Орынбор қазақтары туралы Ереже\"",
        "«Түркістан өлкесін басқару»",
        "\"Жетісуды басқару туралы Ереже\""
      ],
      correctOptionIndex: 2),
  Question(
      id: 220,
      text: "1886 жылдан бастап Түркістан өлкесіне енген облыстар:",
      options: [
        "Ақмола, Семей, Жетісу",
        "Орал, Торғай, Ақмола",
        "Сырдария, Ферғана, Самарқан",
        "Закаспий, Амудария"
      ],
      correctOptionIndex: 2),
  Question(
      id: 221,
      text:
          "1886 жылғы Ереже бойынша Сырдария, Ферғана, Самарқан облыстары кірген генерал-губернаторлық:",
      options: [
        "Орынбор",
        "Батыс Сібір",
        "Түркістан",
        "Далалық"
      ],
      correctOptionIndex: 2),
  Question(
    id: 222,
    text: "1886 жылғы Ереже бойынша Түркістан өлкесінің басқару орталығы:",
    options: ["Верный", "Ташкент", "Самарқанд", "Әулиеата"],
    correctOptionIndex: 1,
  ),
  Question(
    id: 223,
    text: "1882 жылы құрылған генерал-губернаторлық:",
    options: [
      "Орынбор",
      "Батыс Сібір",
      "Түркістан",
      "Дала генерал-губернаторлығы",
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 224,
    text: "1882 жылы құрылған Дала генерал-губернаторлығының құрамына кірген облыстар:",
    options: [
      "Орал, Торғай, Сырдария",
      "Ақмола, Семей, Жетісу",
      "Ферғана, Самарқанд, Закаспий",
      "Ақмола, Семей, Орал",
    ],
    correctOptionIndex: 1,
  ),
  Question(
      id: 225,
      text:
          "Дала генерал-губернаторлығына кірген үш облыстың орталығы болған қала:",
      options: ["Орынбор", "Омбы", "Ташкент", "Верный"],
      correctOptionIndex: 1),
  Question(
      id: 226,
      text:
          "ХІХ ғ. 80-90 жылдарындағы әкімшілік реформалар нәтижесінде үшке бөлінді:",
      options: ["Орта жүз", "Ұлы жүз", "Кіші жүз", "Қазақ хандығы"],
      correctOptionIndex: 2),
  Question(
      id: 227,
      text:
          "ХІХ ғ. 80-90 жылдарындағы әкімшілік реформалар нәтижесінде Кіші жүз бөлінген аймақтар:",
      options: [
        "Тек Ішкі Орда",
        "Тек Дала генерал-губернаторлығы",
        "Бір бөлігі Ішкі Орда, екінші бөлігі Закаспий облысының, үшінші бөлігі Дала генерал-губернаторлығының құрамында болды",
        "Тек Закаспий облысы"
      ],
      correctOptionIndex: 2),
  Question(
      id: 228,
      text:
          "ХІХ ғасырдың 90 жылдары реформа бойынша ірі қалаларда құрылды:",
      options: [
        "Әскери соттар",
        "Билер соты",
        "Полиция басқармалары",
        "Ақсақалдар кеңесі"
      ],
      correctOptionIndex: 2),
  Question(
      id: 229,
      text: "XIX ғасырдың І жартысында Қазақстан экономикасындағы ірі өзгеріс:",
      options: [
        "Жердің мемлекет меншігіне өтуі",
        "Жергілікті өнеркәсіп пен кәсіпшіліктің пайда болуы",
        "Салықтың көбеюі",
        "Әскери бекіністердің салынуы"
      ],
      correctOptionIndex: 1),
  Question(
      id: 230,
      text:
          "1866 жылы шаруаларға Қазақстан аумағына өз беттерінше қоныс аударуына рұқсат берді:",
      options: [
        "Түркістан генерал-губернаторы",
        "Орынбор генерал-губернаторы",
        "Батыс Сібір бас басқармасы",
        "Ішкі істер министрлігі"
      ],
      correctOptionIndex: 2),
  Question(
      id: 231,
      text:
          "1868 жылы «Шаруалардың Жетісуға қоныс аударуы туралы уақытша ережені» қабылдауға ұсыныс жасады:",
      options: [
        "Черняев",
        "Колпаковский",
        "Перовский",
        "Романовский"
      ],
      correctOptionIndex: 1),
  Question(
      id: 232,
      text:
          "1868 жылы «Жетісуда шаруаларды қоныстандыру туралы» ережесіне сай жан басына берілген жер көлемі:",
      options: ["10 десятина", "20 десятина", "30 десятина", "50 десятина"],
      correctOptionIndex: 2),
  Question(
      id: 233,
      text: "ХІХ ғ. 70-80 жылдары Жетісуға қоныс аударған халықтар:",
      options: [
        "Орыстар, украиндар",
        "Татарлар, башқұрттар",
        "Ұйғырлар, дүнгендер",
        "Немістер, поляктар"
      ],
      correctOptionIndex: 2),
  Question(
      id: 234,
      text:
          "Ұйғыр, дүнген халықтарын Жетісуға қоныс аударуға мәжбүрлеген мемлекет:",
      options: [
        "Ресей",
        "Қытай",
        "Жоңғария",
        "Қоқан хандығы"
      ],
      correctOptionIndex: 1),
  Question(
      id: 235,
      text: "Ұйғыр, дүнгендер қоныстанған Жетісу жеріндегі аймақ:",
      options: [
        "Қапал, Лепсі",
        "Верный, Жаркент",
        "Ұзынағаш, Кәстек",
        "Аягөз, Ақсу"
      ],
      correctOptionIndex: 1),
  Question(
    id: 236,
    text: "XIX ғасырдың екінші жартысында Қазақстанға қоныстанған ұйғыр, дүнгендер айналысқан негізгі кәсібі:",
    options: [
      "Мал шаруашылығы",
      "Егіншілік, бау-бақша өсіру",
      "Сауда",
      "Қолөнер"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 237,
    text: "ХХ ғасырдың басында патша үкіметінің Қазақстандағы кен орындарын шетелдік кәсіпкерлерге сатуының негізгі себебі:",
    options: [
      "Қазақ жерін игеру",
      "Шетелдік инвестиция тарту",
      "Орыс кәсіпкерлерінің тәжірибесі мен техникасы нашар болды",
      "Жергілікті халықты жұмыспен қамту"
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 238,
    text: "Қазақ жеріндегі тау-кен кәсіпорындарының акцияларына ие болған батыс елдері:",
    options: [
      "Франция, Италия, Испания",
      "АҚШ, Германия, Швеция",
      "Жапония, Корея, Қытай",
      "Түркия, Иран, Ауғанстан"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 239,
    text: "ХІХ ғ. шетелдіктерге сатылған кәсіпорын:",
    options: [
      "Ембі мұнай кәсіпшілігі",
      "Спасск мыс кеніші, Риддер, Қарағанды, Екібастұз",
      "Жезқазған мыс кені",
      "Зырянов кен орны"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 240,
    text: "1904 жылы австриялықтар сатып алған кен орындары:",
    options: [
      "Екібастұз, Қарағанды",
      "Риддер мен Зырян",
      "Жезқазған, Қоңырат",
      "Ащысай, Мырғалымсай"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 241,
    text: "ХІХ ғ. мұнай өндірілген өңірлер:",
    options: [
      "Маңғыстау, Үстірт",
      "Доссор, Жем өзендерінің бойында",
      "Жетісу, Алтай",
      "Сарыарқа, Бетпақдала"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 242,
    text: "ХХ ғасыр басында мұнай өндіруді ең бірінші иеленген шетелдік кәсіпкерлер:",
    options: [
      "Француздар",
      "Немістер",
      "Ағылшындар",
      "Америкалықтар"
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 243,
    text: "1911 жылы мұнай өндіріле бастаған кәсіпорын:",
    options: [
      "Қарашұңғыл",
      "Мақат",
      "Доссор кәсіпшілігі",
      "Ембі"
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 244,
    text: "ХІХ ғ. тұз өндірілген Батыс Қазақстандағы кәсіпшіліктер:",
    options: [
      "Индер, Арал",
      "Басқұншақ, Елтон",
      "Қошқар, Теңіз",
      "Жетісу, Балқаш"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 245,
    text: "1909 жылы 4 миллион пұт тұз өндіріліп, 10 мыңнан астам жұмысшысы болған кәсіпшілік:",
    options: ["Басқұншақ", "Елтон", "Коряков", "Индер"],
    correctOptionIndex: 2,
  ),
  Question(
    id: 246,
    text: "Қазақстанда балық аулаудың дәстүрлі орталықтары:",
    options: [
      "Ертіс, Тобыл, Есіл",
      "Арал, Каспий теңіздері, Зайсан, Балқаш көлдері",
      "Іле, Шу, Талас",
      "Сырдария, Әмудария"
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 247,
    text: "ХХ ғасырдың басында Қазақстанда химия өнеркәсібінің алғашқы кәсіпорны:",
    options: [
      "Орал тері илеу зауыты",
      "Семей былғары зауыты",
      "Шымкент дермене (сантонин) зауыты",
      "Петропавл жүн жуу фабрикасы"
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 248,
    text: "ХХ ғасырдың басында Бүкіл Ресей империясындағы жалғыз сантонин зауыты:",
    options: [
      "Оралда",
      "Семейде",
      "Шымкент сантонин зауыты",
      "Петропавлда"
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 249,
    text: "1833 жылы Қарағанды көмірін ашқан алғашқылардың бірі:",
    options: [
      "Қосым Пішенбаев",
      "Нұрлан Байжанов",
      "Аппақ Байжанов",
      "Мұса Шорманұлы"
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 250,
    text: "Ертіс бойындағы және Орталық Қазақстандағы көптеген кен орындарын тұңғыш рет ашқан адам:",
    options: [
      "Аппақ Байжанов",
      "Косым Пішенбаев",
      "Нұрлан Байжанов",
      "Мұса Шорманұлы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 251,
    text: "Капиталистік қатынастардың нәтижесінде қазақ даласында теміржол салу қажеттігі:",
    options: [
      "Жолаушылар тасымалдау үшін",
      "Әскери мақсатта",
      "Өндірілген шикізатты тасып әкету үшін",
      "Халықтың көшіп-қонуы үшін"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 252,
    text: "1906 жылы іске қосылған теміржол:",
    options: [
      "Сібір теміржолы",
      "Түрксіб теміржолы",
      "Орынбор-Ташкент",
      "Закаспий теміржолы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 253,
    text: "ХІХ ғ. 70-80 жылдарынан бастап күнкөріс табу мақсатымен тау-кен орындарына жалданған қазақтарды атады:",
    options: [
      "Қазақтар",
      "Жұмысшылар",
      "Жатақтар",
      "Шаруалар"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 254,
    text: "Қазақстандағы жәрмеңкелік сауданың негізі қаланған аймақ:",
    options: [
      "Орта жүз",
      "Ұлы жүз",
      "Бөкей ордасы",
      "Кіші жүз"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 255,
    text: "Ресми түрде тұңғыш жәрмеңке ашылды:",
    options: [
      "Орта жүзде",
      "Ұлы жүзде",
      "Ішкі Ордада",
      "Кіші жүзде"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 256,
    text: "1832 жылы Бөкей Ордасында жәрмеңке ұйымдастырған хан:",
    options: [
      "Әбілқайыр",
      "Абылай",
      "Жәңгір хан",
      "Нұралы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 257,
    text: "Жәрмеңкелерді орналасқан жерімен сәйкестендіріңіз: 1)Қарқаралы уезі, 2) Орал облысы; 3)Верный уезі, 4)Семей уезі; А) Шар, Ә) Қарқара, Б) Қоянды, В) Ойыл, Жауабы: A) 1-А, 2-Ә, 3-Б, 4-В B) 1-Б, 2-В, 3-Ә, 4-А C) 1-В, 2-Б, 3-А, 4-Ә D) 1-Ә, 2-А, 3-В, 4-Б",
    options: [
      "1-А, 2-Ә, 3-Б, 4-В",
      "1-Б, 2-В, 3-Ә, 4-А",
      "1-В, 2-Б, 3-А, 4-Ә",
      "1-Ә, 2-А, 3-В, 4-Б"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 258,
    text: "Варкав Ботовтың атымен аталатын жәрмеңке:",
    options: [
      "Шар",
      "Қарқара",
      "Қоянды",
      "Ойыл"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 259,
    text: "1881 жылы Ресей мен Қытай арасында жасалған келісім:",
    options: [
      "Құлжа келісімі",
      "Петербург келісімі",
      "Айғұн келісімі",
      "Тяньцзин келісімі"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 260,
    text: "1881 жылы сауда келісіміне қол қойған елдер:",
    options: [
      "Ресей, Жоңғария",
      "Қытай, Ресей",
      "Қытай, Жоңғария",
      "Ресей, Қоқан"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 261,
    text: "ХІХ ғасырдың 2 жартысындағы орыс-қытай экономикалық қатынасындағы белді оқиға:",
    options: [
      "Жібек жолының ашылуы",
      "Іле су жолының ашылуы",
      "Сауда келісімінің жасалуы",
      "Теңіз жолының ашылуы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 262,
    text: "Алғаш Іле су жолын ашқан көпес:",
    options: [
      "Н.М. Пржевальский",
      "П.П. Семенов-Тян-Шанский",
      "В.Юлдашев",
      "Г.Н. Потанин"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 263,
    text: "1789 жылы ашылған оқу орны:",
    options: [
      "Омбы кадет корпусы",
      "Омбы азиялық училищесі",
      "Неплюев кадет корпусы",
      "Орынбор кадет корпусы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 264,
    text: "ХІХ-ХХ ғасыр бас кезінде Қазақстанда халыққа білім беру ісінде жүргізілген бағыттар:",
    options: [
      "Тек діни",
      "Тек зайырлы",
      "Діни және зайырлы",
      "Тек әскери"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 265,
    text: "ХІХ ғасырдың І жартысында Қазақстанда ірі медреселерде оқылған тіл:",
    options: [
      "Орыс тілі",
      "Араб тілі",
      "Қазақ тілі",
      "Парсы тілі"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 4266,
    text: "1870 жылы патша үкіметі медреселерде оқытуға міндеттеді:",
    options: [
      "Қазақ тілін",
      "Араб тілін",
      "Орыс тілін",
      "Парсы тілін"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 4268,
    text: "ХХ ғасырдың басында Қазақстанда пайда болды:",
    options: [
      "Тек ескі әдістемелік мектептер",
      "Тек орыс-қазақ мектептері",
      "Жаңа әдістемелік мектептер",
      "Тек діни мектептер"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 4269,
    text: "Оқытудың жаңа әдісі жәдитшілдіктің негізін қалаушы белгілі түркі тілдес халық ағартушыларының бірі, қоғам қайраткері:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Ш. Уәлиханов",
      "И. Гаспринский"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 4270,
    text: "Барлық мұсылман қауымының біртұтас ислам мемлекетіне бірігуін негіздейтін діни-саяси идеология:",
    options: [
      "Жәдитшілдік",
      "Панисламизм",
      "Суфизм",
      "Ваххабизм"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 271,
    text: "ХІХ-ХХ ғасыр басында жаңа әдіспен оқытатын Орынбордағы медресе:",
    options: [
      "\"Ғалия\"",
      "\"Усмания\"",
      "\"Хусаиния\"",
      "\"Расулия\""
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 272,
    text: "1900 жылы Қазақстанда ең алғашқы жаңа әдістемелік мектеп ашылған қала:",
    options: [
      "Орынбор",
      "Түркістан",
      "Семей",
      "Омбы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 273,
    text: "Жәңгір ханның ағарту саласындағы қызметі:",
    options: [
      "Медресе ашты",
      "Зайырлы мектеп ашты",
      "Орыс-қазақ мектебін ашты",
      "Әскери мектеп ашты"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 274,
    text: "1850 жылы қазақтарға орысша білім беретін жетіжылдық мектеп ашылған қала:",
    options: [
      "Семей",
      "Орынбор",
      "Омбы",
      "Троицк"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 275,
    text: "1861 жылы орыс-қазақ мектебі ашылған қала:",
    options: [
      "Орынбор",
      "Омбы",
      "Троицк",
      "Семей"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 276,
    text: "1861 жылы Троицкіде ашылған мектеп:",
    options: [
      "Жетіжылдық мектеп",
      "Орыс-қазақ мектебі",
      "Мұғалімдер семинариясы",
      "Әскери училище"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 277,
    text: "1872 жылы мұғалімдер семинариясы ашылған қала:",
    options: [
      "Орынбор",
      "Омбы",
      "Троицк",
      "Семей"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 278,
    text: "1872 жылы Омбыда ашылған оқу орны:",
    options: [
      "Кадет корпусы",
      "Мұғалімдер семинариясы",
      "Орыс-қазақ мектебі",
      "Әйелдер гимназиясы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 279,
    text: "1879 жылы екі сыныптық орыс-қазақ мектебі ашылды:",
    options: [
      "Орынбор облысында",
      "Семей облысында",
      "Торғай облысында",
      "Ақмола облысында"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 280,
    text: "1883 жылы Ор қаласында ашылған:",
    options: [
      "Кадет корпусы",
      "Мұғалімдер мектебі",
      "Орыс-қазақ мектебі",
      "Әйелдер гимназиясы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 281,
    text: "Ор қаласындағы мұғалімдер мектебінің ашылуына үлес қосқан тұлға:",
    options: [
      "Ш. Уәлиханов",
      "А. Құнанбаев",
      "Ы. Алтынсарин",
      "Ж. Жабаев"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 282,
    text: "1885 жылдан бастап Қазақстанның барлық уездерінде ашылған оқу орны:",
    options: [
      "Орыс-қазақ мектептері",
      "Мұғалімдер семинариялары",
      "Ауылшаруашылық мектептері",
      "Әскери училищелер"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 283,
    text: "ХІХ ғасырдың екінші жартысынан бастап халыққа білім беру орталықтарына айналған қалалар:",
    options: [
      "Түркістан, Әулиеата, Шымкент",
      "Омбы, Орал, Ақмола",
      "Семей, Петропавл, Өскемен",
      "Верный, Қапал, Лепсі"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 284,
    text: "ХХ ғ. басында Қазақстандағы оқу-ағарту орталықтарының бірі:",
    options: [
      "Орынбор",
      "Омбы",
      "Семей",
      "Түркістан"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 285,
    text: "Санкт-Петербург университетінің заң факультетін бітіріп шыққан қазақ зиялылары:",
    options: [
      "Ә. Бөкейхан, С. Асфендияров",
      "М. Шоқай, А. Тұрлыбаев",
      "Б. Қаратаев, Ж. Досмұхамедов",
      "М. Тынышбаев, С. Меңдешев"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 286,
    text: "Санкт-Петербургтың Орман институтын бітіріп шыққан алаш зиялысы:",
    options: [
      "М. Шоқай",
      "Ә. Бөкейхан",
      "С. Асфендияров",
      "А. Байтұрсынұлы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 287,
    text: "Санкт-Петербург әскери медицина академиясын бітіріп шыққан алаш зиялысы:",
    options: [
      "М. Дулатұлы",
      "А. Байтұрсынұлы",
      "С. Асфендияров",
      "Ж. Ақбаев"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 288,
    text: "Петербург әйелдер медицина институтын бітіріп шыққан қазақ әйелдері:",
    options: [
      "Нәзипа Құлжанова, Мариям Сейдалина",
      "Гүлсім мен Мәриям Асфендиярова",
      "Аққағаз Досжанова, Шолпан Иманбаева",
      "Д) Фатима Ғабитова, Сара Есова"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 289,
    text: "Кесенесі Шығыс Қазақстан облысы аумағында жерленген жырау:",
    options: [
      "Бұқар жырау",
      "Ақтамберді",
      "Тәтіқара",
      "Шалкиіз"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 290,
    text: "Халықты бірлікке шақырып «көмекей әулие» атанған жырау:",
    options: [
      "Ақтамберді",
      "Тәтіқара",
      "Бұқар жырау",
      "Шалкиіз"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 291,
    text: "XVIIІ ғасырдағы қазақ әдебиетінің өкілі, ұлы тұлғалардың бірі, Абылайдың кеңесшісі болған жырау:",
    options: [
      "Ақтамберді",
      "Тәтіқара",
      "Бұқар жырау",
      "Шалкиіз"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 292,
    text: "XVIII ғ. аяғы мен ХІХ ғ. басында өмір сүрген жыраулар:",
    options: [
      "Бұқар, Ақтамберді",
      "Тәтіқара, Шал, Көтеш",
      "Шалкиіз, Доспамбет",
      "Қазтуған, Жиембет"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 293,
    text: "Қазақтың аса ұлы күйшісі, күй атасы:",
    options: [
      "Тәттімбет",
      "Дәулеткерей",
      "Құрманғазы",
      "Ықылас"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 294,
    text: "ХІХ ғ. қазақ күй өнерінің классигі, күйші:",
    options: [
      "Тәттімбет",
      "Дәулеткерей",
      "Құрманғазы",
      "Ықылас"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 295,
    text: "Құрманғазының бізге жеткен күйлер саны:",
    options: [
      "40-қа жуық",
      "50-ге жуық",
      "60-қа жуық",
      "70-ке жуық"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 296,
    text: "Бөкей Ордасының Жиделі жерінде дүниеге келген күйші:",
    options: [
      "Тәттімбет",
      "Дәулеткерей",
      "Құрманғазы Сағырбайұлы",
      "Ықылас"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 297,
    text: "Шыңғыс тұқымынан шыққан ХІХ ғасырдағы қазақ күйшісі:",
    options: [
      "Тәттімбет",
      "Дәулеткерей",
      "Құрманғазы",
      "Ықылас"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 298,
    text: "Қазақ хандарының ұрпағы, музыка өнерінің қайраткері:",
    options: [
      "Тәттімбет",
      "Ықылас",
      "Дәулеткерей Шығайұлы",
      "Құрманғазы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 299,
    text: "Домбыра өнеріндегі лирикалық бағыттың негізін салушы:",
    options: [
      "Құрманғазы",
      "Ықылас",
      "Дәулеткерей",
      "Тәттімбет"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 300,
    text: "Дәулеткерей Шығайұлының бізге жеткен күйлер саны:",
    options: [
      "20-ға жуық",
      "30-ға жуық",
      "40-қа жуық",
      "50-ге жуық"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 301,
    text: "Дәулеткерей Шығайұлының күйлері:",
    options: [
      "Сарыарқа",
      "Кішкентай",
      "Сарыжайлау",
      "Қосалқа"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 302,
    text: "1855 жылы Петербургте күміс медальға ие болған күйші:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Ықылас"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 303,
    text: "Ресей императоры ІІ Александрды ұлықтау рәсіміне қатысқан, сазгер, күйші:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Ықылас"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 304,
    text: "Саржайлау, Былқылдақ, Бестөре, Сарыөзен, Қосбасар күйлерінің авторы, күйші:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Ықылас"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 305,
    text: "1834 (1835)-1897 жылдары өмір сүрген атақты сазгер, әнші, ақын:",
    options: [
      "Ақан сері",
      "Біржан сал Қожағұлұлы",
      "Жаяу Мұса",
      "Үкілі Ыбырай"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 306,
    text: "Қызылжар (Петропавл) қаласындағы медреседе оқығанда араб, парсы, шағатай тілдерін жақсы меңгерген атақты сазгер, ақын, әнші:",
    options: [
      "Ақан сері",
      "Жаяу Мұса",
      "Біржан сал Қожағұлұлы",
      "Үкілі Ыбырай"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 307,
    text: "1835-1929 жылдары өмір сүрген ақын, композитор:",
    options: [
      "Ақан сері",
      "Біржан сал",
      "Жаяу Мұса Байжанұлы",
      "Үкілі Ыбырай"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 308,
    text: "Баянауыл өлкесінде дүниеге келіп, домбыра, скрипка, гармонь тартуды жастайынан үйренген ақын:",
    options: [
      "Біржан сал",
      "Ақан сері",
      "Жаяу Мұса",
      "Үкілі Ыбырай"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 309,
    text: "Солтүстік өңірде дүниеге келіп, Қызылжар қаласындағы медреседе оқыған атақты ақын:",
    options: [
      "Біржан сал",
      "Жаяу Мұса",
      "Ақан сері Қорамсаұлы",
      "Үкілі Ыбырай"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 310,
    text: "Балқадиша, Маңмаңгер, Құлагер әндерінің авторы:",
    options: [
      "Біржан сал",
      "Жаяу Мұса",
      "Ақан Сері",
      "Үкілі Ыбырай"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 311,
    text: "1843-1916 жылдары өмір сүрген белгілі күйші, қобызшы:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Ықылас"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 312,
    text: "ХІХ ғ. танымал болған күйші, қылқобызда ойнаудың асқан шебері:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Ықылас Дүкенұлы"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 313,
    text: "ХІХ ғасырда танымал болған күйші, қобызшы сазгер «Жезкиік», «Қазан», «Кертолғау» күйлерінің авторы:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Ықылас Дүкенұлы"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 314,
    text: "1854-1921 жылдары Ақтөбе облысы аумағында дүниеге келген, қазақтың дәулескер күйшілерінің бірі:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Қазанғап Тілепбергенұлы"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 315,
    text: "Ноғайлы босқыны, Окоп, Жұртта қалған күйлерінің авторы, күйші:",
    options: [
      "Құрманғазы",
      "Дәулеткерей",
      "Тәттімбет",
      "Қазанғап Тілепбергенұлы"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 316,
    text: "Зарзаман дәуірінің ақындары:",
    options: [
      "Абай Құнанбаев, Ыбырай Алтынсарин, Шоқан Уәлиханов",
      "Дулат Бабатайұлы, Шортанбай Қанайұлы, Мұрат Мөңкеұлы",
      "Махамбет Өтемісұлы, Шернияз Жарылғасұлы, Сүйінбай Аронұлы",
      "Біржан сал Қожағұлұлы, Ақан сері Қорамсаұлы, Жаяу Мұса Байжанұлы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 317,
    text: "Зар заман атты жырдың авторы:",
    options: [
      "Дулат Бабатайұлы",
      "Шортанбай Қанайұлы",
      "Мұрат Мөңкеұлы",
      "Махамбет Өтемісұлы"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 318,
    text: "Мұрат Мөңкеұлының Ресейдің Қазақстанды отарлап алуы кезіндегі қазақ халқының ауыр жағдайын шынайы суреттеген өлеңі:",
    options: [
      "Қыз Жібек",
      "Қозы Көрпеш - Баян сұлу",
      "Үш қиян",
      "Айман - Шолпан"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 319,
    text: "Абайдың шәкірттерінің ішінде ең мол мұра қалдырған:",
    options: [
      "Мағауия Құнанбаев",
      "Ақылбай Құнанбаев",
      "Ш. Құдайбердиев",
      "Тұрағұл Құнанбаев"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 320,
    text: "1858-1931 жылдары өмір сүрген қазақтың көрнекті ақыны, ойшыл, аудармашы, қазақстан тарихын зерттеушілердің бірі:",
    options: [
      "А. Байтұрсынұлы",
      "М. Дулатұлы",
      "Ш. Құдайбердиев",
      "Ж. Аймауытов"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 321,
    text: "ХХ ғасырдың басында жарыққа шыққан Ш.Құдайбердіұлының шығармасы:",
    options: [
      "Қалың мал",
      "Бақытсыз Жамал",
      "Мұсылмандық шарты",
      "Қамар сұлу"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 322,
    text: "1843-1913 жылдары өмір сүрген қазақ халқының тарихын, әдет-ғұрпын, мәдениетін зерттеушілердің бірі:",
    options: [
      "М. Тынышбаев",
      "Құрбанғали Халид",
      "Ә. Бөкейхан",
      "С. Асфендияров"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 323,
    text: "Құрбанғали Халидтің қазақ халқының тарихын зерттеуде құнды дерек саналған еңбегі:",
    options: [
      "Түрік шежіресі",
      "Қазақ тарихы",
      "Тауарих хамса",
      "Оян, қазақ!"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 324,
    text: "1858-1931 жылдары өмір сүрген көрнекті қазақ ақыны, этнограф және ағартушы:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "Мәшһүр Жүсіп Көпейұлы",
      "А. Құнанбаев"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 325,
    text: "ХІХ ғасыр аяғы ХХ ғасырдың басында өмір сүрген қазақтың этнограф ғалымы:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "Мәшһүр Жүсіп Көпейұлы",
      "А. Құнанбаев"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 326,
    text: "1907 жылы Қазан қаласында үш кітабы жарық көрген:",
    options: [
      "Ш. Уәлихановтың",
      "Ы. Алтынсариннің",
      "Мәшһүр Жүсіп Көпейұлының",
      "А. Құнанбаевтың"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 327,
    text: "Мәшһүр Жүсіп Көпейұлы жетік меңгерген тілдер:",
    options: [
      "Тек қазақ тілі",
      "Орыс, қазақ тілдері",
      "Араб, парсы, шағатай",
      "Ағылшын, француз тілдері"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 328,
    text: "Қазақ халқының далалық заңы:",
    options: [
      "Жарғы",
      "Әдет заңы",
      "Шариғат",
      "Яса"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 329,
    text: "Ресей мемлекетінің әр түрлі аймақтарына саяхат еңбегінің авторы:",
    options: [
      "Н.М. Пржевальский",
      "П.П. Семенов-Тян-Шанский",
      "П.С. Паллас",
      "Г.Н. Потанин"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 330,
    text: "XVIIІ ғасырдағы белгілі зерттеуші П.С.Палластың еңбегі:",
    options: [
      "Қырғыз даласының сипаттамасы",
      "Түркістан өлкесі",
      "Ресей мемлекетінің әр түрлі аймақтарына жасалған саяхат",
      "Сібір тарихы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 331,
    text: "Сібір тарихын зерттеген еңбегі үшін «Сібір тарихының атасы» атанды:",
    options: [
      "П.И. Рычков",
      "Г.Ф. Миллер",
      "И.Г. Андреев",
      "А.И. Левшин"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 332,
    text: "Орынбор өлкесінің Колумбы» деген атау алған Ресей ғылым академиясының корреспондент мүшесі:",
    options: [
      "Г.Ф. Миллер",
      "И.Г. Андреев",
      "П. Рычков",
      "А.И. Левшин"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 333,
    text: "Орынбор тарихы және Орынбор өлкесінің топографиясы атты терең зерттеу еңбектерінің авторы:",
    options: [
      "Г.Ф. Миллер",
      "И.Г. Андреев",
      "П.И. Рычков",
      "А.И. Левшин"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 334,
    text: "Орта жүз қырғыз-қайсақтарының сипаттамасы еңбегінің авторы:",
    options: [
      "Г.Ф. Миллер",
      "П.И. Рычков",
      "И.Г. Андреев",
      "А.И. Левшин"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 335,
    text: "Украинаның көрнекті ақыны, суретші қазақ жерінде айдауда болған:",
    options: [
      "А.С. Пушкин",
      "М.Ю. Лермонтов",
      "Т.Г. Шевченко",
      "Н.В. Гоголь"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 336,
    text: "ХІХ ғасырдың 60 жылдары қазақтарды Ресейге танытудағы кең тараған Г.Зелинскийдің шығармасы:",
    options: [
      "Қазақтар романы",
      "Дала поэмасы",
      "Қырғыз поэмасы",
      "Орынбор өлкесі очеркі"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 337,
    text: "Абай Құнанбайұлымен, оның туыстарымен жақын таныс болған поляк азаттық қозғалысының өкілдері:",
    options: [
      "А. Мицкевич, Ф. Шопен",
      "С. Гросс, А. Янушкевич",
      "М. Склодовская-Кюри, Г. Сенкевич",
      "Ю. Словацкий, Ц. Норвид"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 338,
    text: "Қырғыз-қазақ немесе қырғыз-қайсақ ордалары мен далаларының сипаттамасы деген еңбектің авторы:",
    options: [
      "П.И. Рычков",
      "И.Г. Андреев",
      "А. Левшин",
      "Г.Ф. Миллер"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 339,
    text: "Торғай облысы. Тарихи очерк атты еңбегінде Қазақстанның саяси дамуы жөнінде сирек кездесетін мәліметтер сақталған зерттеуші:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "А. Добросмыслов",
      "В.В. Радлов"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 340,
    text: "Көрнекті зерттеуші П.П.Семенов-Тянь-Шанскийдің Қазақ өлкесі туралы жазған еңбегі:",
    options: [
      "Қазақ жері",
      "Дала өлкесі",
      "Қырғыз өлкесі",
      "Түркістан өлкесі"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 341,
    text: "Г.Потанин өз еңбектерін арнаған зерттеуші:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Шоқан Уәлиханов",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 342,
    text: "Зерттеуші Ә.Диваев Қазақстан тарихын жазуда маңызды деп санады:",
    options: [
      "Тек жазба деректерді пайдалануды",
      "Тек ауызша деректерді пайдалануды",
      "Фольклорлық материалдарды пайдалануды",
      "Археологиялық қазбаларды пайдалануды"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 343,
    text: "Қазақ халқының аса көрнекті ағартушыларының бірі:",
    options: [
      "А. Құнанбаев",
      "М. Дулатұлы",
      "Ш. Уәлиханов",
      "Ж. Аймауытов"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 344,
    text: "Ш.Уалихановтың туған жері:",
    options: [
      "Семей",
      "Құсмұрын бекінісі",
      "Орынбор",
      "Верный"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 345,
    text: "1847-1853 жылдары Омбы қаласындағы Сібір кадет корпусында білім алған, қазақтың белгілі ғалымы:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Ш. Уәлиханов",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 346,
    text: "Шоқан Уәлихановпен кадет корпусында танысқан белгілі ғалым, Азияны зерттеуші:",
    options: [
      "П.П. Семенов-Тян-Шанский",
      "Н.М. Пржевальский",
      "Г. Потанин",
      "В.В. Радлов"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 347,
    text: "ХІХ ғасырдың ІІ жартысында Батыс Сібір генерал-губернаторының қарамағында қызмет еткен, ғалым, ағартушы:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Ш. Уәлиханов",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 348,
    text: "ХІХ ғасырдың екінші жартысында еңбектері Ресейде де, одан тыс жерлерде де жарық көрген ғалым:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Ш. Уәлиханов",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 349,
    text: "Қазақ халқының ғылымын таңдаулы еуропалық үлгілер бойынша даму арнасына бағыттаған тұлға:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Ш. Уәлиханов",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 350,
    text: "Шоқан Уәлихановтың басқару ісіне қатысты еңбегі:",
    options: [
      "Қырғыздардың көші-қоны туралы",
      "Қазақтардағы шамандықтың қалдығы",
      "Сот реформасы туралы",
      "Жоңғария очерктері"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 351,
    text: "Шоқан Уәлихановтың қазақ фольклорына қатысты құнды зерттеулерінің бірі:",
    options: [
      "Алпамыс батыр",
      "Ер Тарғын",
      "Қозы Көрпеш-Баян сұлу",
      "Қыз Жібек"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 352,
    text: "1858-1859 жылдары Шоқан Уәлихановтың қатысқан сапары:",
    options: [
      "Жетісуға",
      "Сарыарқаға",
      "Қашғарияға",
      "Сібірге"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 353,
    text: "Ш.Уалиханов қағазға түсірген эпикалық шығарма:",
    options: [
      "Қозы Көрпеш - Баян сұлу",
      "Қыз Жібек",
      "Манас",
      "Алпамыс"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 354,
    text: "Қазақстан мен Орта Азия халықтарының тарихы мен мәдениетін зерттеуге орасан зор үлес қосқан ХІХ ғ. тұлға:",
    options: [
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "Ш. Уәлиханов",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 355,
    text: "Ресейдің ағарту ісіндегі саясаттың шынайы мақсатын жете түсініп, жастарды ғылым-білімге шақырған ағартушы:",
    options: [
      "Ш. Уәлиханов",
      "А. Құнанбаев",
      "Ы. Алтынсарин",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 356,
    text: "1841-1889 жылдары өмір сүрген белгілі қазақ ағартушысы, қоғам қайраткері:",
    options: [
      "Ш. Уәлиханов",
      "А. Құнанбаев",
      "Ы. Алтынсарин",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 357,
    text: "Ы.Алтынсарин 1879 жылы Торғай облысында тағайындалған қызметі:",
    options: [
      "Уезд бастығы",
      "Болыс",
      "Мектеп инспекторы",
      "Аудармашы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 358,
    text: "ХІХ ғасырда алғаш рет қазақ қыздарын оқытуды ұйымдастырушы, педагог:",
    options: [
      "Ш. Уәлиханов",
      "А. Құнанбаев",
      "Ы. Алтынсарин",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 359,
    text: "Ыбырай Алтынсариннің орыс-қазақ мектептеріне арнап жазған оқу құралы:",
    options: [
      "Қазақ хрестоматиясы",
      "Қырғыз хрестоматиясы",
      "Балалар әдебиеті",
      "Мұғалімдерге арналған оқулық"
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 360,
    text: "ХІХ ғасырда қазақ жерінде қолөнер және ауыл шаруашылық мектептерін ұйымдастырған:",
    options: [
      "Ш. Уәлиханов",
      "А. Құнанбаев",
      "Ы. Алтынсарин",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 361,
    text: "Қазақ балалар әдебиетінің негізін қалаушы:",
    options: [
      "Ш. Уәлиханов",
      "А. Құнанбаев",
      "Ы. Алтынсарин",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 362,
    text: "Қазақ халқының аса көрнекті ойшылы, қазақ жазба әдебиетінің негізін қалаушы:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "А. Құнанбайұлы",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 363,
    text: "1845-1904 жылдары өмір сүрген ұлы ақын:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 364,
    text: "Абайдың қазақ халқының болмысы зерделенген нақыл сөздері:",
    options: [
      "Өлеңдері",
      "Поэмалары",
      "Қарасөз",
      "Афоризмдері"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 365,
    text: "Семей облыстық статистикалық комитетіне мүше болған ұлы ақын:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "Абай",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 366,
    text: "Абайдың шәкірттерінің ішінде ең мол мұра қалдырған:",
    options: [
      "Мағауия Құнанбаев",
      "Ақылбай Құнанбаев",
      "Ш. Құдайбердиев",
      "Тұрағұл Құнанбаев"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 367,
    text: "2020 жылы елімізде 175 жылдық мерейтойы аталып өткен ұлы ақын:",
    options: [
      "Ш. Уәлиханов",
      "Ы. Алтынсарин",
      "А. Құнанбаев",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 368,
    text: "Тұлғалар мен шығармаларын сәйкестендіріңіз\nАбай; 2. Шоқан; 3. Ыбырай А) «Ескендір»; В) «Талаптың пайдасы»; С) «Ислам діні» Жауабы: A) 1-А, 2-В, 3-С B) 1-В, 2-С, 3-А C) 1-С, 2-А, 3-В D) 1-А, 2-С, 3-В",
    options: [
      "A) 1-А, 2-В, 3-С",
      "B) 1-В, 2-С, 3-А",
      "C) 1-С, 2-А, 3-В",
      "D) 1-А, 2-С, 3-В"
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 369,
    text: "Қанды жексенбі деген өлеңнің авторы:",
    options: [
      "Ш. Құдайбердиев",
      "А. Байтұрсынұлы",
      "Мәшһүр Жүсіп Көпейұлы",
      "М. Дулатұлы"
    ],
    correctOptionIndex: 2
  ),
];