import 'question.dart';

final List<Question> sixthChapterQuestions = [
  Question(
    id: 6001,
    text: 'Ұлттық мерекелердің ішіндегі ең басты мейрам:',
    options: [
      'Құрбан айт',
      'Ораза айт',
      'Наурыз',
      'Тәуелсіздік күні',
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 6002,
    text: 'Тың игеру жүргізілген облыстар:',
    options: [
      'Оңтүстік Қазақстан, Жамбыл, Алматы',
      'Павлодар, Ақмола, Көкшетау, Қостанай, Солтүстік Қазақстан, Торғай',
      'Батыс Қазақстан, Атырау, Маңғыстау',
      'Шығыс Қазақстан, Семей, Қарағанды'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 6003,
    text: 'Тың жерлердің игерілуі басым көпшілігі негізінен Қазақстанның осы аймағында жүзеге асырылған:',
    options: [
      'Оңтүстік',
      'Батыс',
      'Шығыс',
      'Солтүстік'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 6004,
    text: '1960 жылға дейін Қазақстанға тың және тыңайған жерлерді игеру үшін келген адам саны:',
    options: [
      '1 млн-ға жуық',
      '2 млн-ға жуық',
      '3 млн-ға жуық',
      '500 мыңға жуық'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 6005,
    text: 'Тың және тыңайған жерлерді игерудің жағымды жағы:',
    options: [
      'Мал шаруашылығының дамуы',
      'Дәнді дақылдар өндірісінің артуы',
      'Өнеркәсіптің дамуы',
      'Халықтың әл-ауқатының жақсаруы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 6006,
    text: 'Тың және тыңайған жерлерді игерудің жағымды жағы:',
    options: [
      'Мал шаруашылығының дамуы',
      'Дәнді дақылдар өндірісінің артуы',
      'Өнеркәсіптің дамуы',
      'Халықтың әл-ауқатының жақсаруы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 6007,
    text: '1950-1960 жылдары пайдалануға берілген өнеркәсіп орындары:',
    options: [
      'Қарағанды металлургия комбинаты',
      'Павлодар, Өскемен машина жасау зауыттары',
      'Жезқазған мыс комбинаты',
      'Ақтөбе ферроқорытпа зауыты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 6008,
    text: '1950-1960 жылдары жаңадан іске қосылған өнеркәсіп орны:',
    options: [
      'Қарағанды металлургия комбинаты',
      'Бұқтырма су электрстанциясы',
      'Жезқазған мыс комбинаты',
      'Ақтөбе ферроқорытпа зауыты'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 6009,
    text: 'XX ғ. 50-жылдарының соңында әлеуметтік мәселелерге байланысты жұмысшылар наразылығы өтті:',
    options: [
      'Қарағандыда',
      'Жезқазғанда',
      'Теміртауда',
      'Өскеменде'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 180,
    text: 'О.Сүлейменовтың тұңғыш ғарышкерге арнап шығарған өлеңі:',
    options: [
      'Құланиек',
      'Адамға, табын, Жер енді',
      'Аз и Я',
      'Жер-Ана'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 181,
    text: '1950 жылдары жалпы білім беру мазмұнын жетілдіру мақсатында мектептерде енгізілген өзгеріс:',
    options: [
      'Міндетті орта білім беру енгізілді',
      'Мектептерде машинатану кабинеттері ашылды',
      'Барлық мектептер бір тілде оқытуға көшті',
      'Жоғары оқу орындарына түсу жеңілдетілді'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 182,
    text: 'ХХ ғ. 50 жылдары Қазақстанның солтүстік облыстарының орта білім беру саласында орын алған жағдай:',
    options: [
      'Қазақ тілінде оқытатын мектептер саны көбейді',
      'Қазақ тілінде оқытатын мектептер саны қысқарды',
      'Орыс тілінде оқытатын мектептер жабылды',
      'Барлық мектептер екі тілде оқытуға көшті'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 183,
    text: '1980 жылдары білім беру саласында енгізілген өзгеріс:',
    options: [
      '7 жастан бастап мектепке қабылдау',
      '6 жастан бастап мектепке қабылдау',
      'Міндетті жоғары білім беру енгізілді',
      'Мектептерде ақылы білім беру енгізілді'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 184,
    text: 'Қазақ КСР Ғылым академиясы құрылғанға дейін қазақ даласында жұмыс жасаған ғылыми экспедиция жетекшілері:',
    options: [
      'Қ.Сәтбаев, Е.Бекмаханов',
      'А.Ферсман, А.Самойлович, А.Григорьев',
      'М.Әуезов, С.Мұқанов',
      'А.Байтұрсынов, М.Дулатұлы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 185,
    text: 'Кеңестік Қазақстан ғылымын тұңғыш ұйымдастырушы тұлға:',
    options: [
      'М.Әуезов',
      'Қ.Сәтбаев',
      'С.Асфендияров',
      'Е.Бекмаханов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 186,
    text: 'Қазақ даласының бай табиғи қорларын игеруге орталықтан мықты ғалымдарды үйлестіре білген ғалым:',
    options: [
      'М.Әуезов',
      'Қ.Сәтбаев',
      'С.Асфендияров',
      'Е.Бекмаханов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 187,
    text: 'Қ.Сәтбаевтың басшылығымен ғалым-геологтар болжамды-металлогендік кешенді картасын құрастырды:',
    options: [
      'Батыс Қазақстанның',
      'Оңтүстік Қазақстанның',
      'Орталық Қазақстанның',
      'Шығыс Қазақстанның'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 188,
    text: '1946 ж. маусымда Қазақ КСР Ғылым Академиясының ашылуына көмек көрсеткен орыс ғалымдары:',
    options: [
      'М.Ломоносов, Д.Менделеев',
      'С.Вавилов, А.Панкратова, И.Бардин',
      'И.Павлов, И.Сеченов',
      'Н.Вавилов, Т.Лысенко'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 189,
    text: 'ХХ ғасырдың екінші жартысында Қазақстан ғылымының дамуына зор үлес қосқан саяси тұлға:',
    options: [
      'Н.Хрущев',
      'Л.Брежнев',
      'Д.А.Қонаев',
      'М.Горбачев'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 190,
    text: '1955-1985 жылдары республика өнеркәсіп өндірісінің дамуына игі әсер еткен қоғам қайраткері:',
    options: [
      'Н.Хрущев',
      'Л.Брежнев',
      'Д.А.Қонаев',
      'М.Горбачев'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 191,
    text: '1960-1970 жылдары катализаторларды электрохимиялық әдістермен зерттеу мәселесін дұрыс көтере білген ғалым:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'Д.Сокольский',
      'У.Ахметсафин'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 192,
    text: '1960-1970 жылдары гидрогеология және гидрофизика ғылымдары саласында нәтижелі еңбек еткен ғалым:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'Д.Сокольский',
      'У.Ахметсафин'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 193,
    text: '1960-1970 жылдары генетика мен микробиология саласында қомақты табыстарға жеткен ғалым:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'М.Айтхожин',
      'У.Ахметсафин'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 194,
    text: 'Еңбегі Лениндік сыйлықпен атап өтілген генетика мен микробиология саласының ғалымы:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'М.Айтхожин',
      'У.Ахметсафин'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 195,
    text: 'Соғыстан кейінгі жылдары көшпелілердің қола дәуіріндегі тарихы мен мәдениетін зерттеген:',
    options: [
      'Қ.Сәтбаев',
      'Е.Бекмаханов',
      'Ә.Марғұлан',
      'С.Асфендияров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 196,
    text: '1957-1959 жылдары Тарих, археология және этнография институтында жарық көрген:',
    options: [
      'Қазақ әдебиеті',
      'Қазақ тілі',
      'Қазақ КСР тарихы',
      'Қазақстан географиясы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 197,
    text: 'Тарих, археология және этнография институтына есімі берілген тұлға:',
    options: [
      'А.Құнанбайұлы',
      'Ы.Алтынсарин',
      'Ш.Уәлиханов',
      'Ә.Бөкейханов'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 198,
    text: 'XX ғасырдың 60-80 жылдары ғылыми еңбектерді бағалау оның авторларына ғылыми дәреже беру шешілді:',
    options: [
      'Алматыда',
      'Астанада',
      'Мәскеуде',
      'Қазақстан қалаларында'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 199,
    text: '1943 жылы Алматыда жарық көрген еңбек:',
    options: [
      'Көне заманнан бүгінге дейінгі Қазақ КСР тарихы',
      'Қазақ әдебиеті',
      'Қазақ тілі',
      'Қазақстан географиясы'
    ],
    correctOptionIndex: 0,
  ),
  Question(
    id: 200,
    text: '1940 жылдардың соңы-1950 жылдардың басында ғылым саласында орын алған жағдай:',
    options: [
      'Ғылым қарқынды дамыды',
      'Қуғын-сүргіннің жаңа толқыны басталды',
      'Шетелдік ғалымдармен байланыс күшейді',
      'Жаңа ғылыми орталықтар ашылды'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 201,
    text: 'Қазақтың заңғар жазушысы, ғалым, Лениндік, КСРО Мемлекеттік сыйлықтардың лауреаты:',
    options: [
      'Ғ.Мүсірепов',
      'С.Мұқанов',
      'М.Әуезов',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 202,
    text: '1949 жылы «Абай» романы үшін Мемлекеттік сыйлыққа ұсынылған қазақ жазушысы:',
    options: [
      'Ғ.Мүсірепов',
      'С.Мұқанов',
      'М.Әуезов',
      'І.Жансүгіров'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 203,
    text: 'М.Әуезовтың КСРО Мемлекеттік сыйлығын алған шығармасы:',
    options: [
      'Қилы заман',
      'Абай',
      'Қараш-Қараш',
      'Хан Кене'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 204,
    text: 'Ә.Нұрпейісовтың КСРО Мемлекеттік сыйлыққа ұсынылған еңбегі:',
    options: [
      'Абай жолы',
      'Ұлпан',
      'Қан мен тер',
      'Соңғы парыз'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 205,
    text: '«Қан мен тер» трилогиясының авторы:',
    options: [
      'М.Әуезов',
      'Ғ.Мүсірепов',
      'Ә.Нұрпейісов',
      'І.Есенберлин'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 206,
    text: 'Хан Кенесары Қасымұлы туралы тарихи шындықты жазған жазушы:',
    options: [
      'М.Әуезов',
      'Ғ.Мүсірепов',
      'Ә.Нұрпейісов',
      'І.Есенберлин'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 207,
    text: 'Шығармаларын екі тілде бірдей жазатын қазақ жазушыларының бірі:',
    options: [
      'М.Әуезов',
      'Ғ.Мүсірепов',
      'Ә.Нұрпейісов',
      'Ә.Әлімжанов'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 208,
    text: 'ХХ ғасырдың 70-80 жылдары шығармаларында патриоттық және интернационалдық тақырыптар туралы жазған:',
    options: [
      'М.Мақатаев, Ш.Мұртаза',
      'Қ.Бекхожин, Ж.Молдағалиев',
      'О.Сүлейменов, Т.Айбергенов',
      'І.Есенберлин, Ә.Кекілбаев'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 209,
    text: 'Х.Ерғалиевтің қазақ кеңес поэзиясының алтын қорына қосылған поэмасы:',
    options: [
      'Абай жолы',
      'Ұлпан',
      'Құрманғазы', 'Біздің ауылдың қызы',
      'Соңғы парыз'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 210,
    text: '1949 жылы қоюшылары мен орындаушыларының бір тобы КСРО Мемлекеттік сыйлығына ұсынылған опера:',
    options: [
      'Қыз Жібек',
      'Біржан-Сара',
      'Абай',
      'Ер Тарғын'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 211,
    text: '1949 жылы КСРО Мемлекеттік сыйлығына ұсынылған «Біржан-Сара» операсының авторы, белгілі сазгер:',
    options: [
      'А.Жұбанов',
      'Е.Брусиловский',
      'М.Төлебаев',
      'Л.Хамиди'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 212,
    text: 'Ұлы Отан соғысынан кейінгі жылдарда симфониялық кемел туындыларын дүниеге әкелген композиторлар:',
    options: [
      'А.Жұбанов, Л.Хамиди',
      'Е.Рахмадиев, С.Мұхамеджанов, Ғ.Жұбанова',
      'М.Төлебаев, Қ.Қожамияров',
      'Н.Тілендиев, Ш.Қалдаяқов'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 213,
    text: 'Этнографиялық оркестр құрып, ән жазуды ұлттық сарындағы аспапты музыканы уағыздаумен ұштастырған:',
    options: [
      'А.Жұбанов',
      'Е.Брусиловский',
      'М.Төлебаев',
      'Н.Тілендиев'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 214,
    text: 'Тұңғыш ұйғыр операсы «Назугумды» жазған:',
    options: [
      'А.Жұбанов',
      'Е.Брусиловский',
      'М.Төлебаев',
      'Қ.Қожамияров'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 215,
    text: '1960-1980 жж. ақын-жазушылармен олардың еңбектерін сәйкестендіріңіз:\n1.М.Әуезов; 2.Ғ.Мүсірепов; 3.М.Мақатаев; 4.Т.Молдағалиев; 5.О.Сүлейменов\nА) «Адамға табын жер енді»; В)«Абай жолы»; С) «Зулайды күндер»; Д) «Мавр»; Е) «Ұлпан»',
    options: [
      '1-A, 2-B, 3-C, 4-D, 5-E',
      '1-B, 2-E, 3-D, 4-C, 5-A',
      '1-C, 2-A, 3-E, 4-B, 5-D',
      '1-D, 2-C, 3-B, 4-E, 5-A'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 216,
    text: '1964-1986 жылдары Қазақстанды басқаруға:',
    options: [
      'Н.Хрущев',
      'Л.Брежнев',
      'Д.А.Қонаев',
      'М.Горбачев'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 217,
    text: 'Д.А.Қонаевтың 1986 жылдың желтоқсанына дейін атқарған қызметі:',
    options: [
      'Қазақ КСР Министрлер Кеңесінің төрағасы',
      'Қазақстан КП. ОК. бірінші хатшысы',
      'Қазақ КСР Жоғарғы Кеңесінің төрағасы',
      'Қазақ КСР Президенті'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 218,
    text: '1965 жылғы КСРО-дағы реформаға сәйкес құрылды:',
    options: [
      'Халық Шаруашылық Кеңестері',
      'Салалық бойынша республикалық және одақтық министрліктер',
      'Комитеттер',
      'Агенттіктер'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 219,
    text: '1965 жылғы КСРО-дағы реформаға сәйкес таратылды:',
    options: [
      'Министрліктер',
      'Комитеттер',
      'Агенттіктер',
      'Халық Шаруашылық Кеңесі'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 220,
    text: 'Өнеркәсіпті басқару туралы 1965 жылғы ережеге сай құрылды:',
    options: [
      'Халық шаруашылығы кеңестері (совнархоздар)',
      'Министрліктер',
      'Комитеттер',
      'Агенттіктер'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 221,
    text: '1960 жылы қаңтарда болған пленумда республика партиясының бірінші хатшысы болып сайланған:',
    options: [
      'Н.Хрущев',
      'Л.Брежнев',
      'Д.А.Қонаев',
      'М.Горбачев'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 222,
    text: '1962-1964 жылдары Қазақ КСР Министрлер Кеңесінің төрағасы:',
    options: [
      'Н.Хрущев',
      'Л.Брежнев',
      'Д.А.Қонаев',
      'М.Горбачев'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 223,
    text: 'ХХ ғ. ІІ жартысында жарық көрген тарихи-лингвистикалық шығарма:',
    options: [
      'Қазақ КСР тарихы',
      'О.Сүлейменов «Аз и Я»',
      'Қазақ әдебиеті',
      'Қазақ тілі'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 224,
    text: 'Тоқырау жылдарындағы ұлттық қатынастарда орын алған келеңсіз көріністердің бірі:',
    options: [
      'Қазақ тілінің қолданылу аясының кеңеюі',
      'О.Сүлейменовтың «Аз и Я» кітабының тауар айналымнан алынып тасталуы',
      'Ұлттық мектептердің көбеюі',
      'Ұлттық кадрлардың көбеюі'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 225,
    text: '1975 жылы жарық көрген О.Сүлейменовтың «Аз и Я» кітабында талданған шығарма:',
    options: [
      '\'Манас\' жыры',
      '\'Алпамыс батыр\' жыры',
      '\'Қобыланды батыр\' жыры',
      'Игорь жасағы туралы жыр'
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 226,
    text: 'Славян және түркі этникалық әлемнің шекарасында пайда болған еңбек:',
    options: [
      '\'Манас\' жыры',
      '\'Алпамыс батыр\' жыры',
      '\'Қобыланды батыр\' жыры',
      'Игорь жасағы туралы жыр'
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 227,
    text: 'ХХ ғасырдың 70-80 жылдары КСРО соғыс жүргізген мемлекет:',
    options: [
      'Қытай',
      'Ауғанстан',
      'Вьетнам',
      'Корея'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 228,
    text: '1960 жылдардың екінші жартысында мұнай өндіру мен өңдеу жұмыстарының көлемі арта бастаған түбек:',
    options: [
      'Қырым',
      'Камчатка',
      'Маңғыстау',
      'Таймыр'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 229,
    text: 'ХХ ғ. 60-80 жылдарында Қазақстанда кеңінен игеріле бастаған сала:',
    options: [
      'Ауыл шаруашылығы',
      'Мұнай өндіру',
      'Жеңіл өнеркәсіп',
      'Тамақ өнеркәсібі'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 230,
    text: '1960 жылдары салына бастаған газ өңдейтін завод орналасқан өлке:',
    options: [
      'Атырау',
      'Маңғыстау',
      'Қызылорда',
      'Ақтөбе'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 231,
    text: '1960 жылдары салынған аса ірі су каналы:',
    options: [
      'Ертіс-Қарағанды',
      'Іле-Қапшағай',
      'Шу-Талас',
      'Сырдария-Түркістан'
    ],
    correctOptionIndex: 0
  ),
  Question(
    id: 232,
    text: 'Кеңестік кезеңдегі ауыл шаруашылығындағы қолданылған әдісті анықтаңыз:',
    options: [
      'Интенсивті',
      'Экстенсивті',
      'Инновациялық',
      'Аралас'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 233,
    text: '1986 жылы желтоқсанның 16 күні Қазақстан КП Орталық Комитетінің пленумы Республика партия ұйымының басшысы етіп сайлады:',
    options: [
      'Д.А.Қонаев',
      'Н.Назарбаев',
      'Г.Колбин',
      'М.Горбачев'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 234,
    text: 'Алматыдағы Желтоқсан оқиғасы кезінде дені студент және жұмысшы жастар жиналған алаңның қазіргі атауы:',
    options: [
      'Тәуелсіздік алаңы',
      'Республика алаңы',
      'Астана алаңы',
      'Достық алаңы'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 235,
    text: 'Қазақ КСР Жоғары Кеңесі Төралқасының Алматыдағы 1986 жылғы желтоқсанда болған оқиғаларды тексеру комиссиясының төрағасы:',
    options: [
      'Д.А.Қонаев',
      'Н.Назарбаев',
      'М.Шаханов',
      'О.Сүлейменов'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 236,
    text: 'Желтоқсан оқиғасына дұрыс баға беруге, бейбіт шеруге қатысқан жастарды ақтауға күшін салған қоғам қайраткері:',
    options: [
      'Д.А.Қонаев',
      'Н.Назарбаев',
      'М.Шаханов',
      'О.Сүлейменов'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 237,
    text: '1986 жылғы Алматы қаласындағы Желтоқсан оқиғасына берілген баға:',
    options: [
      'Қазақ ұлтшылдығының көрінісі',
      'Әлеуметтік наразылық',
      'Саяси қақтығыс',
      'Жастардың бас көтеруі'
    ],
    correctOptionIndex: 0
  ),
  Question(
    id: 238,
    text: 'Желтоқсан оқиғасының сипаты:',
    options: [
      'Қарулы көтеріліс',
      'Бейбіт шеру',
      'Террористік акт',
      'Әскери төңкеріс'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 239,
    text: 'Желтоқсан оқиғаларына қатысқаны үшін ұсталып, жаза тартқан адамдардың саны 8500-ге жуық, сотталған адам саны:',
    options: [
      '50 адам',
      '99 адам',
      '200 адам',
      '500 адам'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 240,
    text: 'Желтоқсан оқиғаларына қатысушыларға қарсы коммунистік әкімшіліктің ұйғаруымен жасалған құпия жедел жоспар:',
    options: [
      'Құйын',
      'Дауыл',
      'Бұрқасын-86',
      'Найзағай'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 241,
    text: 'Желтоқсан оқиғаларына қатысқан жастарға тағылған айдар:',
    options: [
      'Контрреволюционер',
      'Халық жауы',
      'Буржуазиялық ұлтшыл',
      'Ұлтшылдық'
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 242,
    text: '«Жасақшы Савицкийді өлтірді» деп айып тағылған, жас демократ, жалынды ақын:',
    options: [
      'М.Шаханов',
      'О.Сүлейменов',
      'Қ.Рысқұлбеков',
      'Т.Айбергенов'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 243,
    text: 'Желтоқсан оқиғасына қатысқаны үшін өлім жазасына кесілген жігерлі жас, жалынды ақын:',
    options: [
      'М.Шаханов',
      'О.Сүлейменов',
      'Қ.Рысқұлбеков',
      'Т.Айбергенов'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 244,
    text: 'Желтоқсан оқиғасына қатысып қаза тапқан қазақ жастары:',
    options: [
      'М.Шаханов, О.Сүлейменов',
      'Қ.Рысқұлбеков, Л.Асанова',
      'Қайрат Рысқұлбеков, Ербол Сыпатаев, Ләззат Асанова, Сәбира Мұхамеджанова',
      'Т.Айбергенов, Ж.Молдағалиев'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 245,
    text: '1996 жылдың 9 желтоқсанында «Халық қаһарманы» атағы берілді:',
    options: [
      'М.Шахановқа',
      'О.Сүлейменовке',
      'Қ.Рысқұлбековке',
      'Л.Асановаға'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 246,
    text: 'Ұлттық рухтың жаңғыру, қайта түлеу кезеңінің басы болған Желтоқсан қозғалысы:',
    options: [
      'Қазақстанның тәуелсіздік алуына әкелді',
      'Одақтың құлдырауына, ыдырауына әкелді',
      'Қазақстанда демократиялық реформалардың басталуына әкелді',
      'Қазақ тілінің мәртебесін көтерді'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 247,
    text: '1988 жылы Қазақстан Компартиясы Орталық Комитетінің қаулысымен ақталған көрнекті ақын, философ:',
    options: [
      'А.Құнанбаев',
      'Ы.Алтынсарин',
      'Ш.Құдайбердиев',
      'М.Жұмабаев'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 248,
    text: '1988 жылы Қазақстан Компартиясы Орталық Комитетінің қаулысымен ақталған жазушы әрі ғалым, атақты ақын, белгілі саясатшы, педагог, тіл, әдебиет, ғылым, журналистика салаларында мол мұра қалдырған:',
    options: [
      'Ж.Аймауытов, М.Жұмабаев, М.Дулатұлы, А.Байтұрсынов',
      'М.Әуезов, Ғ.Мүсірепов, С.Мұқанов',
      'І.Есенберлин, Ә.Кекілбаев',
      'О.Сүлейменов, М.Шаханов'
    ],
    correctOptionIndex: 0
  ),
  Question(
    id: 249,
    text: '1989 жылдың маусымында халық бұқарасының ірі бас көтеруі өткен қала:',
    options: [
      'Алматы',
      'Қарағанды',
      'Жаңаөзен',
      'Семей'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 250,
    text: '1989 жылы 22 қыркүйекте қабылданған заң:',
    options: [
      '\'Қазақ КСР-нің Мемлекеттік егемендігі туралы\' Декларация',
      'Қазақ КСР-індегі Тілдер туралы заңы',
      '\'Қазақ КСР-нің азаматтығы туралы\' Заңы',
      'Қазақ КСР-нің Конституциясы'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 251,
    text: '1990 жылдағы республика өміріндегі аса маңызды саяси оқиға:',
    options: [
      'Қазақ КСР-інің атауы Қазақстан Республикасы болып өзгертілді',
      '«Қазақ КСР-нің Мемлекеттік егемендігі туралы» Декларация» қабылданды',
      'Қазақ КСР-інің жаңа Конституциясы қабылданды',
      'Қазақстанда Президенттік басқару енгізілді'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 252,
    text: '«Қазақ КСР-нің Мемлекеттік егемендігі туралы» Декларацияға сай Республика басшысы:',
    options: [
      'Бірінші хатшы',
      'Президент',
      'Премьер-министр',
      'Жоғарғы Кеңес төрағасы'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 253,
    text: '1990 жылы 25 қазанда «Қазақ КСР-нің Мемлекеттік егемендігі туралы» Декларация қабылдауы:',
    options: [
      'Республиканың толық тәуелсіздігін жариялады',
      'Республика егемендігін заң жүзінде бекітудің бастамасы болды',
      'Республиканың КСРО құрамынан шығуын жариялады',
      'Республиканың жаңа Конституциясын қабылдады'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 254,
    text: '1990 жылы ұлттық идеяның өзегі ретінде тұтас қазақ болмысын зерделеуді ұсынған қоғам қайраткері, жазушы:',
    options: [
      'М.Шаханов',
      'О.Сүлейменов',
      'Ә.Кекілбаев',
      'І.Есенберлин'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 255,
    text: 'ТЖМК басшыларының әкімшілік жүйені қайта жандандырып, республикаларды егемендіктен айыруға деген әрекеті әкеліп соқты:',
    options: [
      'Қазақстанның тәуелсіздік алуына',
      'КСРО-ның күйреуіне',
      'Әскери төңкеріске',
      'Жаңа одақтық шарттың жасалуына'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 256,
    text: '1991 жылы 23 тамызда Н.Назарбаев мәлімдеме жасады:',
    options: [
      'Қазақстан Компартиясының таратылатыны туралы',
      'КОКП ОК Саяси Бюросының құрамынан шығатынын',
      'Қазақстанның тәуелсіздігі туралы',
      'Жаңа одақтық шартқа қол қою туралы'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 257,
    text: '1991 жылы 29 тамызда Елбасы жарлығымен жабылған сынақ алаңы:',
    options: [
      'Азғыр',
      'Капустин Яр',
      'Семей ядролық сынақ полигоны',
      'Байқоңыр'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 258,
    text: 'Н.Назарбаев «Семей ядролық сынақ полигонын жабу туралы» Жарлыққа қол қойды:',
    options: [
      '1990 жылы 25 қазанда',
      '1991 жылы 29 тамызда',
      '1991 жылы 16 желтоқсанда',
      '1992 жылы 2 наурызда'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 259,
    text: 'Қазақстанның 1991 жылы Семей ядролық сынақ полигонын жабуы:',
    options: [
      'Экономикалық дағдарысқа әкелді',
      'Қазақстанның әлем алдындағы абыройын асқақтатты',
      'Халықаралық қатынастардың шиеленісуіне әкелді',
      'Әскери қуаттың әлсіреуіне әкелді'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 260,
    text: '1999 жылы БҰҰ аясында Семейдегі сынақ салдары мәселелеріне арналған халықаралық конференция өтті:',
    options: [
      'Семейде',
      'Алматыда',
      'Мәскеуде',
      'Токиода'
    ],
    correctOptionIndex: 3
  ),
  Question(
    id: 261,
    text: '1991 жылы 7 қыркүйекте Қазақстан Компартиясының кезектен тыс және төтенше съезі қабылдады:',
    options: [
      'Қазақстан Компартиясының атауын өзгерту туралы шешім',
      'Қазақстан Компартиясын тарату және жаңа партия құру туралы шешім',
      'Жаңа одақтық шартқа қол қою туралы шешім',
      'Қазақстанның тәуелсіздігін жариялау туралы шешім'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 262,
    text: 'Қазақстанның тәуелсіздігін таныған алғашқы мемлекеттердің бірі:',
    options: [
      'АҚШ',
      'Қытай',
      'Түркия',
      'Ресей'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 263,
    text: 'Тәуелсіз Қазақстанның тұңғыш Қорғаныс Министрі:',
    options: [
      'Б.Момышұлы',
      'Т.Бигелдинов',
      'С.Нұрмағамбетов',
      'М.Алтынбаев'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 264,
    text: 'Дүниежүзі қазақтарының құрылтайлары өткен қалалар:',
    options: [
      'Тек Алматы',
      'Тек Астана',
      'Алматы, Түркістан, Астана',
      'Тек Түркістан'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 265,
    text: 'Тарихи отанына қайтқан қандастар:',
    options: [
      'Диаспора',
      'Репатриант',
      'Мигрант',
      'Ирредент'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 266,
    text: '2008 жылы көші-қонды басқару жөнінде қабылданған бағдарлама:',
    options: [
      'Асар',
      'Нұрлы көш',
      'Ақ жол',
      'Қазақстан-2030'
    ],
    correctOptionIndex: 1
  ),
  Question(
    id: 267,
    text: 'Қазақстандағы этносаралық және конфессияаралық келісім саласындағы стратегиялық бағдарламаларды жүзеге асырып отырған ерекше ұйым:',
    options: [
      'Біріккен Ұлттар Ұйымы',
      'Еуропадағы қауіпсіздік және ынтымақтастық ұйымы',
      'Қазақстан халқы Ассамблеясы',
      'Шанхай ынтымақтастық ұйымы'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 268,
    text: 'Этносаралық, дінаралық келісім және ішкі тұрақтылықты нығайтуға ықпал ететін ұйым:',
    options: [
      'Біріккен Ұлттар Ұйымы',
      'Еуропадағы қауіпсіздік және ынтымақтастық ұйымы',
      'Қазақстан халқы Ассамблеясы',
      'Шанхай ынтымақтастық ұйымы'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 269,
    text: '1995 жылы наурызда құрылған қоғамдық ұйым:',
    options: [
      'Қазақстан кәсіподақтар федерациясы',
      'Қазақстан жастар одағы',
      'Қазақстан халқы Ассамблеясы',
      '\'Азамат\' қозғалысы'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 270,
    text: '2002 жылы 26 сәуірде ҚР Президенті Жарлығымен мақсаты мен міндеттері, жұмыс құрылымы мен ұйымдастыру қызметінің негізгі бағыттары белгіленді:',
    options: [
      '\'Қазақстан-2030\' стратегиясының',
      '\'Нұрлы жол\' бағдарламасының',
      'Қазақстан халқы Ассамблеясының стратегиясының',
      '\'Мәңгілік Ел\' идеясының'
    ],
    correctOptionIndex: 2
  ),
  Question(
    id: 271,
    text: 'Қазақстан астанасында өткен Әлемдік және дәстүрлі дін көшбасшыларының съезінің рөлі:',
    options: [
      'Қазақстанның діни орталыққа айналуына ықпал етті',
      'Өркениетаралық және мәдениетаралық қатынасты жаһандық деңгейде көтерді',
      'Діни экстремизмге қарсы күресті күшейтті',
      'Жаңа діни ағымдардың пайда болуына әкелді'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 272,
    text: '2003 жылы Әлемдік және дәстүрлі дін көшбасшыларының I съезі өткен қала:',
    options: [
      'Алматы',
      'Астана қаласы',
      'Түркістан',
      'Шымкент'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 273,
    text: 'Астана қаласында әлемдік және дәстүрлі діндердің ІІ съезі өткен мерзімі:',
    options: [
      '2003 жылы',
      '2006 жылы',
      '2009 жылы',
      '2012 жылы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 274,
    text: '2006 жылы Әлемдік және дәстүрлі діндер көшбасшыларының конгресін өткізу мақсатында елордада салынды:',
    options: [
      '\'Бәйтерек\' монументі',
      '\'Хан Шатыр\' ойын-сауық орталығы',
      'Бейбітшілік және келісім сарайы (Пирамида)',
      '\'Астана Опера\' театры'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 275,
    text: 'Басқа өмір салтына, мінез-құлықтарға, салт-дәстүрлерге, әдет-ғұрыптарға, пікірлерге, идеяларға, дінге төзімділік:',
    options: [
      'Шовинизм',
      'Ұлтшылдық',
      'Толеранттылық',
      'Экстремизм'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 276,
    text: 'Дұрыс дәйекті анықтаңыз\nІ. Қазақстан халқы ассамблеясы 1997 жылы құрылды\nІІ. Мәжіліске Қазақстан халқы ассамблеясынан 15 депутат сайланады\nІІІ. 1 наурыз Қазақстан ұлттарының бір-біріне және қазақ халқына алғыс айту күні\nІV. Қазақстан халық ассамблеясы Президент төрағалық ететін консультативті кеңес органы',
    options: [
      'I, II',
      'II, III',
      'III, IV',
      'I, IV'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 277,
    text: 'Қазақстанның құқықтық мемлекет ретінде дамуының жаңа кезеңі:',
    options: [
      'Тәуелсіздік алуы',
      'Жаңа Конституциясын қабылдауы',
      'Президенттік басқаруға көшуі',
      'Парламенттік республикаға көшуі'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 278,
    text: '1995 жылы тамызда қабылданған Конституцияда тәжірибесі ескерілді:',
    options: [
      'АҚШ-тың',
      'Ресейдің',
      'Францияның',
      'Германияның'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 279,
    text: '1997 жылы қабылданған «Қазақстан 2030» стратегиясының бесінші бағыты:',
    options: [
      'Ұлттық қауіпсіздік',
      'Ішкі саяси тұрақтылық',
      'Экономикалық өсу',
      'Энергетикалық ресурстар'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 280,
    text: '1997 жылы қабылданған «Қазақстан 2030» стратегиясының жетінші бағыты:',
    options: [
      'Денсаулық сақтау',
      'Білім беру',
      'Кәсіби мемлекет',
      'Әлеуметтік қамсыздандыру'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 281,
    text: '2012 жылы қабылданған «Қазақстан-2050» стратегиясы аталады:',
    options: [
      'Жаңа әлемдегі жаңа Қазақстан',
      'Қалыптасқан мемлекеттің жаңа саяси бағыты',
      'Бәсекеге қабілетті Қазақстан',
      'Қазақстанның үшінші жаңғыруы'
    ],
    correctOptionIndex: 1,
  ),
      Question(
    id: 282,
    text: 'Нарықтық экономикаға тән белгі:',
    options: [
      'Мемлекеттік меншіктің басым болуы',
      'Орталықтандырылған жоспарлау',
      'Кәсіпорындарды мемлекет иелігінен алу',
      'Бағаны мемлекеттік реттеу'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 283,
    text: 'Бағаны босату сөзінің мағынасы:',
    options: [
      'Бағаны мемлекеттік реттеу',
      'Бағаны көтеру',
      'Бағаны төмендету',
      'Заттың өзіндік құнын белгілеу'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 284,
    text: 'КСРО-ға кіретін елдердің тәуелсіздік алғаннан кейін өзара міндетті қарыздарын өтей алмауынан пайда болды:',
    options: [
      'Инфляция',
      'Девальвация',
      'Көлеңкелі экономика',
      'Дефолт'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 285,
    text: 'Тәуелсіздіктің алғашқы жылдарында өзара экономикалық байланыс жасап тұрған елдер өзара міндетті төлемдерін өтей алмағаны аталды:',
    options: [
      'Инфляция',
      'Девальвация',
      'Төлем дағдарысы',
      'Дефолт'
    ],
    correctOptionIndex: 2,
  ),
      Question(
    id: 286,
    text: 'Ақшаның құнсыздануы, ақша айналысының тауар айналымынан артық мөлшерде болуы:',
    options: [
      'Инфляция',
      'Девальвация',
      'Деноминация',
      'Дефолт'
    ],
    correctOptionIndex: 0,
  ),
Question(
    id: 287,
    text: '1993 жылы 15 қарашада Қазақстан өзінің:',
    options: [
      'Жаңа Конституциясын қабылдады',
      'Ұлттық валютасын енгізді',
      'Тәуелсіздігін жариялады',
      'Жаңа әнұранын қабылдады'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 288,
    text: '1993 жылдың соңында қабылданған ұлттық маңызы бар шара:',
    options: [
      'Қазақстан Республикасының Қарулы Күштері құрылды',
      'Теңге айналымға енді',
      'Қазақстан БҰҰ-ға мүше болды',
      'Қазақстан Республикасының тұңғыш Президенті сайланды'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 289,
    text: 'Ұлттық валютаны енгізу туралы Қазақстан Президентінің Жарлығы шықты:',
    options: [
      '1991 жылы 16 желтоқсанда',
      '1992 жылы 2 наурызда',
      '1993 жылы 12 қарашада',
      '1995 жылы 30 тамызда'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 290,
    text: 'Қазақстан Республикасы экономикалық тәуелсіздігінің айқын көрінісі:',
    options: [
      'Шетелдік инвестицияларды тарту',
      'Ұлттық валютаны енгізу',
      'Жекешелендіруді жүргізу',
      'Нарықтық экономикаға көшу'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 291,
    text: 'Алғашқы ұлттық валютада бейнеленген тарихи тұлғалардың бірі:',
    options: [
      'Қ.Сәтбаев',
      'М.Әуезов',
      'А.Құнанбайұлы, Ш.Уәлиханов, Абылай хан',
      'Ы.Алтынсарин'
    ],
    correctOptionIndex: 2,
  ),
Question(
    id: 292,
    text: 'Пайда табу мақсатында ел ішінде және шетел экономикасының салаларына ұзақ мерзімді капитал салу:',
    options: [
      'Девальвация',
      'Деноминация',
      'Инвестиция',
      'Ревальвация'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 293,
    text: '1993 жылдың 5 наурызында кәсіпорындарда төрт бағыт бойынша жүргізілген экономикалық реформа:',
    options: [
      'Ұлттандыру',
      'Жекешелендіру',
      'Индустрияландыру',
      'Ұжымдастыру'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 294,
    text: '1993 жылы қабылданған жекешелендірудің төртінші бағыты:',
    options: [
      'Тұрғын үй қорын жекешелендіру',
      'Шағын кәсіпорындарды жекешелендіру',
      'Жаппай жекешелендіру',
      'Агроөнеркәсіп кешені кәсіпорындарын жекешелендіру'
    ],
    correctOptionIndex: 3,
  ),
  Question(
    id: 295,
    text: 'Нарықтық экономикаға көшудің құқықтық негізін құру мақсатында Республика Парламенті қабылдаған заң:',
    options: [
      '\'Қазақстан Республикасының азаматтығы туралы\' Заңы',
      '\'Қазақстан Республикасындағы шетел инвесторлары',
      'Қазақстан Республикасының мемлекеттік шекарасы туралы\' Заңы',
      '\'Қазақстан Республикасының Қарулы Күштері туралы\' Заңы'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 296,
    text: 'ЭКСПО-2017 халықаралық көрмесінің негізгі тақырыбы:',
    options: [
      'Ғаламшар энергиясы',
      'Болашақтың энергиясы',
      'Жасыл экономика',
      'Инновациялық технологиялар'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 297,
    text: 'ХХІ ғасырда іске қосылған жаңа технологияға негізделген арнайы экономикалық аймақ:',
    options: [
      'Астана - жаңа қала',
      'Ақтау теңіз порты',
      'Ақпараттық технологиялар паркі',
      'Ұлттық индустриалды мұнай-химия технопаркі'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 298,
    text: 'ХХІ ғасырда қызметін бастаған «Ақтау теңіз портының» статусы:',
    options: [
      'Еркін экономикалық аймақ',
      'Индустриалды аймақ',
      'Арнайы экономикалық аймақ',
      'Туристік аймақ'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 299,
    text: 'Авто жол құрылысы:',
    options: [
      'Орталық-Оңтүстік',
      'Батыс Еуропа – Батыс Қытай',
      'Астана-Алматы',
      'Орталық-Шығыс'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 300,
    text: 'Экономикалық жүйе түрлерін тиісті кезеңдермен сәйкестендіріңіз:\nНарықтық, 2) Дәстүрлі, 3) Жоспарлы; А) Ресейге қосылғанға дейін, Ә) Кеңестік жүйе кезеңінде, Б) Тәуелсіздік алғаннан кейін',
    options: [
      '1-А, 2-Ә, 3-Б',
      '1-Ә, 2-Б, 3-А',
      '1-Б, 2-А, 3-Ә',
      '1-Б, 2-Ә, 3-А'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 301,
    text: 'Қазақстан 1992 жылы 2 наурызда мүше болып қабылданған ең мәртебелі ұйым:',
    options: [
      'Еуропа Одағы',
      'Біріккен Ұлттар Ұйымы (БҰҰ)',
      'Шанхай ынтымақтастық ұйымы',
      'Тәуелсіз Мемлекеттер Достастығы'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 302,
    text: '1992 жылы Қазақстан Республикасы мүшелікке өткен беделді халықаралық ұйым:',
    options: [
      'Әлемдік банк',
      'Халықаралық валюта қоры',
      'ЮНЕСКО',
      'Дүниежүзілік сауда ұйымы'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 303,
    text: '1992 жылы Қазақстанның бірінші елшілігі ашылған ел:',
    options: [
      'АҚШ',
      'Ресей',
      'Түркия',
      'Қытай'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 304,
    text: '1992 жылы Түрксой ұйымына мүше болған елдер:',
    options: [
      'Қазақстан, Қырғызстан, Түркіменстан',
      'Әзірбайжан, Қазақстан, Қырғызстан, Түрікменстан, Түркия, Өзбекстан',
      'Түркия, Иран, Пәкістан',
      'Қазақстан, Ресей, Белоруссия'
    ],
    correctOptionIndex: 1,
  ),
 Question(
    id: 305,
    text: '2002 жылы 3-4 маусымда АӨСШК алғашқы саммиті өтті:',
    options: [
      'Астанада',
      'Алматыда',
      'Мәскеуде',
      'Ыстамбұлда'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 306,
    text: '1993 жылы Қазақстан Республикасымен ресми дипломатиялық қатынастар орнатты:',
    options: [
      'АҚШ',
      'Еуроодақ',
      'Қытай',
      'Ресей'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 307,
    text: 'ХХІ ғ. алғаш болып кеден одағын құрған мемлекеттер:',
    options: [
      'Қазақстан, Өзбекстан, Түрікменстан',
      'Қазақстан, Ресей, Белоруссия',
      'Ресей, Украина, Белоруссия',
      'Қазақстан, Қырғызстан, Тәжікстан'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 308,
    text: 'Кедендік Одаққа кірген мемлекеттер:',
    options: [
      'Қазақстан, Өзбекстан, Түрікменстан',
      'Қазақстан, Ресей, Белоруссия',
      'Ресей, Украина, Белоруссия',
      'Қазақстан, Қырғызстан, Тәжікстан'
    ],
    correctOptionIndex: 1,
  ),
 Question(
    id: 309,
    text: '1995 жылы Қазақстан Республикасының бастамасымен құрылған ұйым:',
    options: [
      'Шанхай ынтымақтастық ұйымы',
      'Еуразиялық экономикалық одақ',
      'Кедендік Одақ',
      'Ұжымдық қауіпсіздік туралы шарт ұйымы'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 310,
    text: 'Беларусь, Қазақстан және Ресей басшылары 1995 жылы құжатқа қол қойып:',
    options: [
      'Бірыңғай экономикалық кеңістік құрды',
      'Шекараларында кедендік бақылау жойылды',
      'Бірыңғай валюта енгізді',
      'Әскери одақ құрды'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 311,
    text: '1996 жылы Қазақстан:',
    options: [
      'Біріккен Ұлттар Ұйымына мүше болды',
      'Еуропа Одағына мүше болды',
      'Шанхай ынтымақтастық ұйымын құруға қатысты',
      'НАТО-ға мүше болды'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 312,
    text: 'Шанхай бестігі ұйымының алғашқы бас қосуы өткен ел:',
    options: [
      'Қазақстан',
      'Ресей',
      'Қытай, Шанхай',
      'Қырғызстан'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 313,
    text: '1996 жылы 26 сәуірде Шанхай ынтымақтастық ұйымына қол қойған мемлекеттер:',
    options: [
      'Қазақстан, Ресей, Қытай',
      'Қазақстан, Қырғызстан, Қытай, Тәжікстан, Ресей',
      'Қазақстан, Өзбекстан, Түрікменстан',
      'Қазақстан, Ресей, Белоруссия, Қырғызстан'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 314,
    text: '1996 жылы 26 сәуірде Шанхайда Қазақстан қол қойған келісім:',
    options: [
      'Әскери одақ құру туралы',
      'Шекара аумағын күшейту',
      'Бірыңғай экономикалық кеңістік құру туралы',
      'Ядролық қарудан бас тарту туралы'
    ],
    correctOptionIndex: 1,
  ),
  Question(
    id: 315,
    text: '1992 жылы 15 мамырда «Ұжымдық қауіпсіздік туралы шарт ұйымына» қол қойған елдер:',
    options: [
      'Қазақстан, Ресей, Белоруссия',
      'Қазақстан, Өзбекстан, Түрікменстан',
      'Қазақстан, Тәжікстан, Қырғызстан, Ресей, Армения',
      'Қазақстан, Ресей, Қытай'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 316,
    text: '2002 жылы қайта құрылған ұйым:',
    options: [
      'Шанхай ынтымақтастық ұйымы',
      'Еуразиялық экономикалық одақ',
      'Ұжымдық қауіпсіздік туралы шарт ұйымы',
      'Орталық Азия ынтымақтастығы ұйымы'
    ],
    correctOptionIndex: 3,
  ),
 Question(
    id: 317,
    text: 'ЕҚЫҰ-ға төрағалық еткен бірінші түркі елі:',
    options: [
      'Түркия',
      'Әзірбайжан',
      'Қазақстан',
      'Өзбекстан'
    ],
    correctOptionIndex: 2,
  ),
    Question(
    id: 318,
    text: 'Кеңестік елдер арасында ЕҚЫҰ-ға төрағалық еткен ең алғашқы мемлекет:',
    options: [
      'Ресей',
      'Украина',
      'Қазақстан',
      'Белоруссия'
    ],
    correctOptionIndex: 2,
  ),
  Question(
    id: 319,
    text: '2010 жылы желтоқсанда Қазақстан төрағалық еткен халықаралық ұйым:',
    options: [
      'Біріккен Ұлттар Ұйымы',
      'Еуропа Қауіпсіздігі және Ынтымақтастығы Ұйымы',
      'Шанхай ынтымақтастық ұйымы',
      'Ислам ынтымақтастығы ұйымы'
    ],
    correctOptionIndex: 1,
  ),
    Question(
    id: 320,
    text: '2011 жылы Қазақстан Республикасының Ислам ынтымақтастығы ұйымына төрағалық ету кезіндегі қабылданған шешім:',
    options: [
      'Жаңа мүшелерді қабылдау',
      'Ынтымақтастықты тереңдету',
      'Ұйымның атауын өзгерту',
      'Ұйымның штаб-пәтерін ауыстыру'
    ],
    correctOptionIndex: 1,
  ),
  Question(
      id: 321,
      text:
          'Тарихи оқиғалардың ретін анықтаңыз:\n1) Қазақстанның Ислам Конференциясы ұйымына төрағалық етуі, 2) Қазақстан мен Қытай арасында дипломатиялық қатынас орнауы, 3) АҚШ-тың Қазақстан Республикасының тәуелсіздігін мойындауы',
      options: ['1, 2, 3', '2, 3, 1', '3, 2, 1', '3, 1, 2'],
      correctOptionIndex: 2),
  Question(
      id: 322,
      text:
          'Оқиғалардың реттілігін анықтаңыз:\n1) Н.Назарбаев Еуразиялық Одақ құруды ұсынды, 2) Қазақстан Біріккен Ұлттар Ұйымына кірді, 3) Қазақстанның Еуропа Қауіпсіздігі және Ынтымақтастығы Ұйымына төрағалық етті',
      options: ['1, 2, 3', '2, 1, 3', '3, 2, 1', '2, 3, 1'],
      correctOptionIndex: 1),
  Question(
      id: 323,
      text:
          'Қазақстан Республикасын халықаралық ұйымдарға мүше болған жылдарымен сәйкестендіріңіз:\n1) Ислам конференциясы ұйымы, 2) Біріккен Ұлттар Ұйымы, 3) Дүниежүзілік сауда ұйымы, А) 1992 жылы, Ә) 2015 жылы, Б) 1995 жылы',
      options: ['1-А, 2-Ә, 3-Б', '1-Б, 2-А, 3-Ә', '1-Ә, 2-Б, 3-А', '1-Б, 2-Ә, 3-А'],
      correctOptionIndex: 1),
  Question(
      id: 324,
      text: '2015 жылы Қазақстан Республикасы мүшелікке қабылданған ұйым:',
      options: [
        'Еуропа Одағы',
        'НАТО',
        'Дүниежүзілік сауда ұйымы (ДСҰ)',
        'Шанхай ынтымақтастық ұйымы'
      ],
      correctOptionIndex: 2),
  Question(
      id: 325,
      text: 'Дарынды жастарды шетелде оқытуға арналған бағдарлама:',
      options: ['Нұрлы көш', 'Болашақ', 'Дипломмен ауылға', 'Жасыл ел'],
      correctOptionIndex: 1),
  Question(
      id: 326,
      text: '2014 жылы Майамида (АҚШ) ең үздік бағдарлама деп танылды:',
      options: ['Нұрлы көш', 'Болашақ', 'Дипломмен ауылға', 'Жасыл ел'],
      correctOptionIndex: 1),
  Question(
      id: 327,
      text: '1996 жылы Елордада Елбасының бастамасымен құрылған оқу орны:',
      options: [
        'Назарбаев Университеті',
        'Қазақ ұлттық университеті',
        'Л.Н.Гумилев атындағы Еуразия ұлттық университеті',
        'Қазақ-Британ техникалық университеті'
      ],
      correctOptionIndex: 2),
  Question(
      id: 328,
      text:
          'Түркістан қаласындағы халықаралық қазақ-түрік университетіне есімі берілген тұлға:',
      options: [
        'Абай Құнанбаев',
        'Ыбырай Алтынсарин',
        'Қожа Ахмет Ясауи',
        'Әл-Фараби'
      ],
      correctOptionIndex: 2),
  Question(
      id: 329,
      text: '2003 жылы қоғамдық ұйымға айналған мекеме:',
      options: [
        'Қазақстан халқы Ассамблеясы',
        'Ұлттық Ғылым академиясы',
        'Қазақстан Жазушылар одағы',
        'Қазақстан Композиторлар одағы'
      ],
      correctOptionIndex: 1),
  Question(
      id: 330,
      text: '2004 жылы Президент бастамасымен қабылданған мемлекеттік бағдарлама:',
      options: ['Нұрлы жол', 'Мәдени мұра', 'Болашақ', '100 мектеп, 100 аурухана'],
      correctOptionIndex: 1),
  Question(
      id: 331,
      text:
          'Тарих және археология ескерткіштерін сақтау және қалпына келтіруде жүзеге асырыла бастаған мемлекеттік бағдарлама:',
      options: ['Нұрлы жол', 'Мәдени мұра', 'Болашақ', '100 мектеп, 100 аурухана'],
      correctOptionIndex: 1),
  Question(
      id: 332,
      text: '2010 жылы Елбасы бастамасымен ашылған оқу орны:',
      options: [
        'Қазақ ұлттық университеті',
        'Л.Н.Гумилев атындағы Еуразия ұлттық университеті',
        'Назарбаев университеті',
        'Қазақ-Британ техникалық университеті'
      ],
      correctOptionIndex: 2),
  Question(
      id: 333,
      text: 'А.Әмірқұловтың халықаралық дәрежеде танылған фильмдері:',
      options: [
        'Қыз Жібек', 'Атаманның ақыры',
        'Отырардың күйреуі', 'Қош бол, Гүлсары!',
        'Менің атым Қожа', 'Гауһартас',
        'Шәкен Айманов', 'Қазақфильм'
      ],
      correctOptionIndex: 1),
  Question(
    id: 334,
    text: 'Н.Ә. Назарбаев 2014 жылы «Қазақстан жолы-2050: бір мақсат, бір мүдде, бір болашақ» атты жолдауында ұсынған идея:',
    options: [
      '"Қазақстан - 2030"',
      '"Нұрлы жол"',
      '"Мәңгілік Ел"',
      '"Цифрлық Қазақстан"'
    ],
    correctOptionIndex: 2
  ),
Question(
    id: 335,
    text: 'Азаматтық, теңдік, еңбексүйгіштік, ғылым мен білімге құрмет, зайырлы ел сияқты құндылықтар көрініс тапқан Тұңғыш Президент ұсынған ұлттық идея:',
     options: [
      '"Қазақстан - 2030"',
      '"Нұрлы жол"',
      '"Мәңгілік Ел"',
      '"Цифрлық Қазақстан"'
    ],
    correctOptionIndex: 2
  ),
];